<!DOCTYPE html>
<html lang="sq">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="shortcut icon" type="image/x-icon" href="../foto/icon.png" />
    <meta name="keywords" content="CSS, meso CSS ne shqip" />
      <meta property="og:url"           content="https://veglat.netlify.app/css/" />
      <meta property="og:type"          content="website" />
      <meta property="og:title"         content="CSS - Mëso CSS në gjuhën shqipe" />
      <meta property="og:description"   content="Web tutorial per te mesuar CSS" />
      <meta property="og:image"         content="https://veglat.netlify.app/css/foto/css3-s.png" />
    <link rel="stylesheet" href="../style/default.css">
    <link rel="stylesheet" href="../style/global.css">
    <link rel="stylesheet" href="style/style.css">
    <link rel="stylesheet" href="../style/nata.css">
    <script src="../script/highlight.js"></script>
    <script>hljs.initHighlightingOnLoad();</script>
    <title>CSS</title>
</head>
<body>
<div id="loader">
    <img src="../foto/loading.gif" alt="Loading..." />
</div>
<div id="grid">

<div id="navigimi">
    <header>
        <div class="logo"><a href="/">VEGLAT SOFTUERIKE</a></div>
        <div id="nata" title="Modi i errët/ndritshëm">
            <img id="img-logo" src="foto/hena.svg">
        </div>
        <div id="burger">
            <span class="viza"></span>
            <span class="viza"></span>
            <span class="viza"></span>
        </div>
    </header>

    <nav>
        <a href="../html/">HTML</a>
        <a href="#" class="aktiv">CSS</a>
        <a href="../js/">JavaScript</a>
        <a href="../sql/">SQL</a>
        
    </nav>
</div>

<div id="wrapper">
    <article>
        <h3>REFERENCA</h3>
        <ul>
            <li><a href="https://www.w3schools.com/css/default.asp" target="_blank">w3Schools.com</a></li>
            <li><a href="https://css-tricks.com/" target="_blank">css-tricks.com</a></li>
            <li><a href="https://developer.mozilla.org/en-US/docs/Learn/CSS" target="_blank">developer.mozilla.org</a></li>
            <li><a href="https://www.javatpoint.com/css-tutorial" target="_blank">javaTpoint.com</a></li>
            <li><a href="https://www.codecademy.com/learn/learn-css" target="_blank">codecademy.com</a></li>
            <li><a href="https://www.learn-html.org/" target="_blank">learn-html.org</a></li>
            <li><a href="https://www.coderepublics.com/CSS/css-tutorial.php" target="_blank">codeRepublics.com</a></li>
            <li><a href="https://www.freecodecamp.org/learn/responsive-web-design/basic-css/" target="_blank">freeCodeCamp.org</a></li>
            <li><a href="https://www.bitdegree.org/learn/css" target="_blank">bitDegree.org</a></li>
            <li><a href="https://www.khanacademy.org/computing/computer-programming/html-css/intro-to-css/pt/css-basics" target="_blank">khanAcademy.org</a></li>
            <li><a href="https://www.sololearn.com/learning/1023" target="_blank">soloLearn.com</a></li>
            <li><a href="https://scrimba.com/allcourses?price=free&topic=css" target="_blank">scrimba.com</a></li>
        </ul>
    </article>

    <aside>
        <h3>CSS</h3>
        <ul>
            <li><a href="#CSS-njohuri-themelore">Njohuri themelore</a></li>
            <li><a href="#hyrje-ne-css">Hyrje në CSS</a></li>
            <li><a href="#sintaksa-css">Sintaksa CSS</a></li>
            <li><a href="#selektoret">Selektorët</a></li>
            <li><a href="#ngjyrat">Ngjyrat</a></li>
            <li><a href="#color-picker">Zgjedhësi i ngjyrave</a></li>
            <li><a href="#sfondi">Sfondi</a></li>
            <li><a href="#fontet">Fontet</a></li>
            
        </ul>
    </aside>

    <main>

        <section id="CSS-njohuri-themelore">
            <h1>CSS &ndash; Njohuri themelore</h1>
            <p>CSS &euml;sht&euml; teknologjia kryesore prezantuese q&euml; p&euml;rdoret n&euml; krijimin Ueb Faqeve.</p>
            <div class="figure jonata">
                <img src="foto/css3.png" alt="CSS">
            </div>
            <p><strong>CSS</strong> &euml;sht&euml; akronim nga <strong><em>C</em></strong><em>ascading <strong>S</strong>tyle <strong>S</strong>heets</em>. CSS &euml;sht&euml; nj&euml; gjuh&euml; standarde p&euml;r stilizim t&euml; faqeve q&euml; p&euml;rdoret n&euml; p&euml;rshkrim t&euml; prezantimit (d.m.th. paraqitjen dhe formatimin) e ueb faqeve.</p>
            <p>Para CSS, gati t&euml; gjitha atributet prezantuese t&euml; dokumenteve HTML ishin t&euml; p&euml;rmbajtura brenda kodit HTML (specifikisht brenda etiketave HTML); t&euml; gjitha ngjyrat e shkronjave, stilet e sfondit, radhitjet e elementeve, kufijt&euml; dhe madh&euml;sit&euml; duhej t&euml; p&euml;rshkruheshin qart&euml; n&euml; HTML.</p>
            <p>Si rezultat, zhvillimi i ueb sajteve t&euml; m&euml;dha u b&euml; nj&euml; proces i v&euml;shtir&euml; dhe i shtrenjt&euml;, pasi stilizimi duhet shtuar duke u p&euml;rs&euml;ritur n&euml; &ccedil;do ueb faqe individuale t&euml; ueb sajit.</p>
            <p>P&euml;r t&euml; zgjidhur k&euml;t&euml; problem, CSS u prezantua n&euml; vitin 1996 nga <em>World Wide Web Consortium</em> (W3C), i cili gjithashtu mir&euml;mban standardin e tij. CSS u krijua p&euml;r t&euml; mund&euml;suar ndarjen e prezantimit (stilizimit) dhe p&euml;rmbajtjes. Tani ueb dizajner&euml;t mund t&euml; zhvendosin informacionin e formatimit t&euml; ueb faqeve n&euml; nj&euml; fajll stilizimi t&euml; ve&ccedil;ant&euml; e q&euml; rezulton me fajlla m&euml; t&euml; thjesht&euml; t&euml; HTML-s&euml; dhe mir&euml;mbajtje m&euml; t&euml; mir&euml;.</p>
            <p>CSS3 &euml;sht&euml; versioni m&euml; i fundit i specifikimeve CSS. CSS3 shton disa ve&ccedil;ori t&euml; reja n&euml; stilizim dhe mund&euml;son avancim t&euml; p&euml;rmir&euml;suar n&euml; prezantimet e ueb faqeve.</p>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: K&euml;to m&euml;sime p&euml;r CSS do t'ju ndihmoj&euml; t&euml; m&euml;soni bazat e gjuh&euml;s m&euml; t&euml; fundit t&euml; CSS3, nga temat m&euml; elementare deri tek ato t&euml; avancuara hap pas hapi.</p>
            </div>

            <h2>&Ccedil;far&euml; mund t&euml; b&euml;ni me CSS?</h2>
            <p>Ka shum&euml; gj&euml;ra q&euml; mund t&euml; b&euml;ni me CSS.</p>
            <ul>
            <li>Mund t&euml; zbatoni me leht&euml;si stilizim t&euml; nj&euml;jt&euml; n&euml; disa elemente.</li>
            <li>Mund t&euml; kontrolloni prezantimin e shum&euml; ueb faqeve t&euml; nj&euml; ueb sajti me nj&euml; fajll t&euml; vet&euml;m t&euml; stilizimit.</li>
            <li>Mund ta paraqisni t&euml; nj&euml;jt&euml;n faqe ndryshe n&euml; pajisje t&euml; ndryshme.</li>
            <li>Mund t&euml; stilizoni gjendje dinamike t&euml; elementeve t&euml; tilla si hover, fokus, etj. E q&euml; nuk &euml;sht&euml; e mundur ndryshe.</li>
            <li>Mund t&euml; ndryshoni pozicionin e nj&euml; elementi n&euml; nj&euml; ueb faqe pa e ndryshuar sh&euml;nimin.</li>
            <li>Mund t&euml; ndryshoni shfaqjen e elementeve ekzistuese n&euml; HTML.</li>
            <li>Mund t&euml; transformoni elemente si shkalla, rrotullimi, pjerrt&euml;simi, etj. n&euml; hap&euml;sir&euml;n 2D ose 3D.</li>
            <li>Mund t&euml; krijoni efekte animacioni dhe tranzicioni pa e p&euml;rdorur JavaScript-in.</li>
            <li>Mund t&euml; krijoni nj&euml; version p&euml;r shtypje t&euml; ueb faqeve.</li>
            </ul>
            <p>Lista nuk p&euml;rfundon k&euml;tu, ka shum&euml; gj&euml;ra t&euml; tjera interesante q&euml; mund t&euml; b&euml;ni me CSS.</p>
            <h2>P&euml;rpar&euml;sit&euml; e p&euml;rdorimit t&euml; CSS-s&euml;</h2>
            <p>P&euml;rpar&euml;sia m&euml; e madhe e CSS-s&euml; &euml;sht&euml; se lejon ndarjen e stilit dhe paraqitjes nga p&euml;rmbajtja e dokumentit. K&euml;tu kemi dh&euml;n&euml; edhe disa p&euml;rpar&euml;si tjera:</p>
            <ul>
            <li><strong>CSS kursen shum&euml; koh&euml;</strong> &ndash; CSS jep shum&euml; fleksibilitet p&euml;r t&euml; vendosur vetit&euml; e stilit t&euml; nj&euml; elementi. Mund t&euml; shkruani CSS-n&euml; nj&euml; her&euml;; dhe pastaj i nj&euml;jti kod mund t&euml; zbatohet n&euml; grupet t&euml; elementeve HTML, e gjithashtu mund t&euml; rip&euml;rdoret n&euml; shum&euml; faqe HTML.</li>
            <li><strong>Mir&euml;mbajtje e thjesht&euml;</strong> &ndash; CSS ofron nj&euml; mjet t&euml; thjesht&euml; p&euml;r t&euml; p&euml;rdit&euml;suar formatimin e dokumenteve dhe p&euml;r t&euml; ruajtur q&euml;ndrueshm&euml;rin&euml; n&euml; shum&euml; dokumente. P&euml;r shkak se p&euml;rmbajtja e t&euml;r&euml;sis&euml; s&euml; ueb faqeve mund t&euml; kontrollohet leht&euml;sisht duke p&euml;rdorur nj&euml; ose m&euml; shum&euml; fajlla p&euml;r stilzim.</li>
            <li><strong>Faqet lexohen m&euml; shpejt&euml;</strong> &ndash; CSS i mund&euml;son disa faqeve p&euml;r t&euml; ndar&euml; informacionin e formatimit, e q&euml; zvog&euml;lon kompleksitetin dhe p&euml;rs&euml;ritjen n&euml; p&euml;rmbajtjen strukturale t&euml; dokumenteve. Gjithashtu ndjesh&euml;m zvog&euml;lon madh&euml;sin&euml; e transferimit t&euml; fajllit, e q&euml; rezulton n&euml; nj&euml; lexim m&euml; t&euml; shpejt&euml; t&euml; faqes.</li>
            <li><strong>Stilet m&euml; superiore n&euml; HTML</strong> &ndash; CSS ka aft&euml;si prezantuese shum&euml; m&euml; t&euml; m&euml;dha se HTML dhe siguron kontroll shum&euml; m&euml; t&euml; mir&euml; t&euml; paraqitjes s&euml; ueb faqeve. K&euml;sisoj mund t'i jepni nj&euml; pamje shum&euml; m&euml; t&euml; mir&euml; ueb faqeve n&euml; krahasim me elementet dhe atributet prezantuese t&euml; HTML-s&euml;.</li>
            </ul>
            <p><strong>P&euml;rputhshm&euml;ri n&euml; pajisje t&euml; ndryshme</strong> &ndash; CSS lejon gjithashtu q&euml; ueb faqet t&euml; optimizohen p&euml;r m&euml; shum&euml; se nj&euml; lloj pajisjeje ose media. P&euml;rdorimi i CSS-it n&euml; t&euml; nj&euml;jtin dokument HTML mund t&euml; paraqitet n&euml; stile t&euml; ndryshme shikimi p&euml;r pajisje (ekrane) si desktop, telefona inteligjent&euml;, etj.</p>
            <div class="keshille">
                <p><strong>K&euml;shill&euml;</strong>: Tani shumica e atributeve HTML po zhvler&euml;sohen dhe nuk rekomandohet t&euml; p&euml;rdoren. Prandaj &euml;sht&euml; nj&euml; ide e mir&euml; t&euml; p&euml;rdorni sa m&euml; shum&euml; CSS p&euml;r t&euml; rritur p&euml;rshtatshm&euml;rin&euml; e ueb sajtit dhe t'i b&euml;ni ato t&euml; p&euml;rputhshme me shfletuesit e ardhsh&euml;m.</p>
            </div>
        </section>

        <section id="hyrje-ne-css">
            <h1>Hyrje n&euml; CSS</h1>
            <p>N&euml; k&euml;t&euml; kaptin&euml; do t&euml; m&euml;soni se sa e leht&euml; &euml;sht&euml; t&euml; shtoni informacione p&euml;r stilin dhe formatimin n&euml; ueb faqe duke p&euml;rdorur CSS. Por, para se t&euml; filloni, duhet t&euml; keni disa njohuri p&euml;r HTML.</p>
            <h2>P&euml;rfshirja e CSS-it n&euml; dokumentet HTML</h2>
            <p>CSS mund t&euml; bashk&euml;ngjitet si nj&euml; dokument i ve&ccedil;ant&euml; ose i sh&euml;nuar n&euml; vet&euml; dokumentin HTML. Ekzistojn&euml; tri metoda p&euml;r t&euml; p&euml;rfshir&euml; CSS-n&euml; n&euml; nj&euml; dokument HTML:</p>
            <ul>
            <li><strong>Stilet inline</strong> &ndash; P&euml;rdorimi i atributit style n&euml; etiket&euml;n fillestare HTML.</li>
            <li><strong>Stilet e brendshme</strong> &ndash; P&euml;rdorimi i elementit <code>&lt;style&gt;</code> n&euml; pjes&euml;n kryesore t&euml; dokumentit HTML.</li>
            <li><strong>Stilet e jasht&euml;m</strong> &ndash; P&euml;rdorimi i elementit <code>&lt;link&gt;</code>, p&euml;r tu lidhur me nj&euml; fajll t&euml; jasht&euml;m CSS.</li>
            </ul>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Stilet inline kan&euml; p&euml;rpar&euml;sin&euml; m&euml; t&euml; lart&euml;, dhe stilet e jasht&euml;m kan&euml; m&euml; t&euml; ult&euml;n. Do t&euml; thot&euml; n&euml;se specifikoni stilet p&euml;r nj&euml; element si n&euml; stilin e <em>brendsh&euml;m </em>ashtu edhe n&euml; at&euml; t&euml; stilit t&euml; <em>jasht&euml;m</em>, sipas rregullit stili i brendsh&euml;m do t&euml; mbizot&euml;roj stilin e jasht&euml;m.</p>
            </div>
            <h3>Stilet inline</h3>
            <p>Stilet inline p&euml;rdoren p&euml;r t&euml; zbatuar rregullat e stilit unik n&euml; nj&euml; element duke vendosur rregullat CSS direkt n&euml; etiket&euml;n fillestare. Mund t'i bashk&euml;ngjitet nj&euml; elementi duke p&euml;rdorur atributin <code>style</code>.</p>
            <p>Atributi <code>style</code> p&euml;rfshin nj&euml; varg t&euml; &ccedil;ifteve t&euml; vetive dhe vlerave t&euml; CSS-it. &Ccedil;do pal&euml; <code>"veti: vler&euml;"</code> ndahet me nga nj&euml; pik&euml;presje (<code>;</code>), ashtu si do t&euml; shkruani n&euml; stilin e brendsh&euml;m ose t&euml; jasht&euml;m, por duhet t&euml; jet&euml; e gjitha n&euml; nj&euml; rresht, k&euml;sisoj:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;h1 style="color:red; font-size:30px;"&gt;Ky &euml;sht&euml; titulli&lt;/h1&gt;
&lt;p style="color:green; font-size:22px;"&gt;Ky &euml;sht&euml; nj&euml; paragraf.&lt;/p&gt;
&lt;div style="color:blue; font-size:14px;"&gt;Kjo &euml;sht&euml; nj&euml; p&euml;rmbajtje tekstuale.&lt;/div&gt;</code></pre>
                </div>
            </div>
            <p>P&euml;rdorimi i stileve inline zakonisht konsiderohet si praktik&euml; jo e mir&euml;. Meqen&euml;se stilet futen direkt brenda etiket&euml;s HTML, kjo b&euml;n q&euml; prezantimi t&euml; p&euml;rzihet me p&euml;rmbajtjen e dokumentit; gj&euml; q&euml; e b&euml;n kodin e v&euml;shtir&euml; p&euml;r tu mir&euml;mbajtur dhe e mohon q&euml;llimin e p&euml;rdorimit t&euml; CSS-s&euml;.</p>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Tek stilizimi inline &euml;sht&euml; e pamundur stilizimi i pseudo-elemente dhe pseudo-klasave. Prandaj, duhet t&euml; shmangni p&euml;rdorimin e atributeve t&euml; stilit n&euml; kodin tuaj. P&euml;rdorimi i fajllit p&euml;r stilizim t&euml; jasht&euml;m &euml;sht&euml; m&euml;nyra e preferuar p&euml;r t&euml; shtuar stile n&euml; dokumentet HTML.</p>
            </div>
            <h3>Stilet e brendshme</h3>
            <p>Stilet e brendsh&euml;m zbatohen vet&euml;m n&euml; dokumentin n&euml; t&euml; cilin jan&euml; sh&euml;nuara.</p>
            <p>Stili i brendsh&euml;m definohet n&euml; seksionin <code>&lt;head&gt;</code> t&euml; dokumentit HTML duke p&euml;rdorur elementin <code>&lt;style&gt;</code>. Mund t&euml; definoni m&euml; shum&euml; se nj&euml; her&euml; elementet <code>&lt;style&gt;</code> n&euml; dokument HTML, por ato duhet t&euml; shfaqen midis etiketave <code>&lt;head&gt;</code> dhe <code>&lt;/head&gt;</code>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;!DOCTYPE html&gt;
&lt;html lang="sq"&gt;
&lt;head&gt;
    &lt;title&gt;Dokumenti HTML&lt;/title&gt;
    &lt;style&gt;
        body { background-color: YellowGreen; }
        p { color: #fff; }
    &lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
    &lt;h1&gt;Ky &euml;sht&euml; titulli&lt;/h1&gt;
    &lt;p&gt;Ky &euml;sht&euml; nj&euml; paragraf tekstual.&lt;/p&gt;
&lt;/body&gt;
&lt;/html&gt;</code></pre>
                </div>
            </div>
            <div class="keshille">
                <p><strong>K&euml;shill&euml;</strong>: Tipi i atributit t&euml; etiketave <code>&lt;style&gt;</code> dhe <code>&lt;link&gt;</code> (d.m.th. <code>type="text/css"</code>) definon gjuh&euml;n e stilizimit. Ky atribut &euml;sht&euml; thjesht informues. Mund ta hiqni k&euml;t&euml; pasi CSS &euml;sht&euml; gjuh&euml; standarde dhe e paracaktuar e stilizimit n&euml; HTML5.</p>
            </div>
            <h3>Stilet e jasht&euml;m</h3>
<p>Nj&euml; stil i jasht&euml;m &euml;sht&euml; ideal kur stili zbatohet n&euml; shum&euml; faqe t&euml; ueb sajtit.</p>
<p>Nj&euml; fajll me stil t&euml; jasht&euml;m mban t&euml; gjitha rregullat e stilit n&euml; nj&euml; dokument t&euml; ve&ccedil;ant&euml; q&euml; mund ta lidhni nga &ccedil;do dokument HTML n&euml; faqen tuaj. Stilet e jasht&euml;m jan&euml; m&euml; fleksib&euml;l, sepse nga nj&euml; fajll i vet&euml;m, mund t&euml; ndryshoni pamjen e t&euml;r&euml; ueb sajtit.</p>
<p>Mund t&euml; bashk&euml;ngjitni fajllat e stilit t&euml; jasht&euml;m n&euml; dy m&euml;nyra &ndash; <em>lidhja</em> dhe <em>importimi</em>.</p>
<p><strong>Lidhja e stilit t&euml; jasht&euml;m</strong></p>
<p>Para krijimit t&euml; lidhjes, duhet s&euml; pari t&euml; krijojm&euml; nj&euml; fajll stilizimi. Hapim editorin tuaj t&euml; preferuar t&euml; kodit dhe krijojm&euml; nj&euml; fajll t&euml; ri. Tani shtypim kodin e m&euml;posht&euml;m CSS brenda k&euml;tij fajlli dhe ruajm&euml; at&euml; si "<code>stili.css</code>".</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>body {
    background: lightyellow;
    font: 18px Arial, sans-serif;
}
h1 {
    color: orange;
}</code></pre>
                </div>
            </div>
            <p>Nj&euml; fajll me stil t&euml; jasht&euml;m mund t&euml; lidhet me nj&euml; dokument HTML duke p&euml;rdorur etiket&euml;n <code>&lt;link&gt;</code>. Etiketa <code>&lt;link&gt;</code> hyn brenda seksionit <code>&lt;head&gt;</code>, si&ccedil; mund ta shihni n&euml; shembullin vijues:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;!DOCTYPE html&gt;
&lt;html lang="sq"&gt;
&lt;head&gt;
    &lt;title&gt;Dokumenti HTML&lt;/title&gt;
    &lt;link rel="stylesheet" href="css/stili.css"&gt;
&lt;/head&gt;
&lt;body&gt;
    &lt;h1&gt;Ky &euml;sht&euml; titulli&lt;/h1&gt;
    &lt;p&gt;Ky &euml;sht&euml; nj&euml; paragraf tekstual.&lt;/p&gt;
&lt;/body&gt;
&lt;/html&gt;</code></pre>
                </div>
            </div>
            <div class="keshille">
                <p><strong>K&euml;shill&euml;</strong>: Nga tri metodat, p&euml;rdorimi i stilit t&euml; jasht&euml;m &euml;sht&euml; metoda m&euml; e mir&euml; p&euml;r definimin dhe zbatimin e stileve n&euml; dokumentet HTML. Si&ccedil; mund ta shihni qart&euml; me stil t&euml; jasht&euml;m, fajlli HTML q&euml; lidh fajllin e jasht&euml;m CSS k&euml;rkon ndryshime minimale n&euml; sh&euml;njim.</p>
            </div>
            <p><strong>Importimi i stilit t&euml; jasht&euml;m</strong></p>
            <p>Rregulli <code>@import</code> &euml;sht&euml; nj&euml; m&euml;nyr&euml; tjet&euml;r p&euml;r t&euml; ngarkuar nj&euml; stil t&euml; jasht&euml;m. Deklarata <code>@import</code> udh&euml;zon shfletuesin t&euml; ngarkoj&euml; nj&euml; stil t&euml; jasht&euml;m dhe t&euml; p&euml;rdor&euml; stilet e saj.</p>
            <p>Mund ta p&euml;rdorni n&euml; dy m&euml;nyra. M&euml; e thjesht&euml; &euml;sht&euml; brenda seksionit head t&euml; dokumentit tuaj. Vini re se, rregulla tjera t&euml; CSS-s&euml; mund t&euml; p&euml;rfshihen akoma n&euml; elementin <code>&lt;style&gt;</code>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;style&gt;
    @import url("css/stili.css");
    p {
        color: blue;
        font-size: 16px;
    }
&lt;/style&gt;</code></pre>
                </div>
            </div>
            <p>Ngjash&euml;m, mund t&euml; p&euml;rdorni rregullin <code>@import</code> p&euml;r t&euml; importuar nj&euml; stil brenda nj&euml; stili tjet&euml;r.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>@import url("css/modeli.css");
@import url("css/ngjyra.css");
body {
    color: blue;
    font-size: 14px;
}</code></pre>
                </div>
            </div>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: T&euml; gjith&euml; rregullat <code>@import</code> duhet t&euml; vendosen n&euml; fillim t&euml; flet&euml;s s&euml; stilit. &Ccedil;do rregull stili i definuar n&euml; stilin e dh&euml;n&euml; mbizot&euml;ron rregullat kund&euml;rshtuese nga stilet e importuar. Sidoqoft&euml;, importimi i nj&euml; stili brenda nj&euml; stili tjet&euml;r nuk rekomandohet p&euml;r shkak t&euml; &ccedil;&euml;shtjes s&euml; performanc&euml;s.</p>
            </div>
        </section>
        
        <section id="sintaksa-css">
            <h1>Sintaksa CSS</h1>
            <p>Nj&euml; flet&euml; stilesh e CSS-s&euml; p&euml;rb&euml;het nga nj&euml; grup rregullash q&euml; interpretohen nga ueb shfletuesi dhe m&euml; pas aplikohen n&euml; elementet p&euml;rkat&euml;se si paragraf&euml;t, titujt, etj.</p>
            <p>Rregulli i CSS-s&euml; ka dy pjes&euml; kryesore, nj&euml; selektor dhe nj&euml; ose m&euml; shum&euml; deklarata:</p>
            <div class="img-kodi elementet-html" style="text-align: center;">
                <img src="foto/css-selector.png" alt="Kodi CSS">
            </div>
            <p>Selektori specifikon se n&euml; cilin element ose n&euml; cilat elemente n&euml; faqen HTML zbatohet rregulli CSS.</p>
            <p>Deklaratat brenda bllokut p&euml;rcaktojn&euml; m&euml;nyr&euml;n e formatimit t&euml; elementeve n&euml; nj&euml; ueb faqe. Secila deklarat&euml; p&euml;rb&euml;het nga nj&euml; veti dhe nj&euml; vler&euml; e ndar&euml; nga dy pika (<code>:</code>) dhe q&euml; mbaron me pik&euml;presje (<code>;</code>), e grupet e deklarimit jan&euml; t&euml; vendosura nga kllapat e m&euml;dha <code>{}</code>.</p>
            <p>Vetia &euml;sht&euml; atribut i stilit q&euml; d&euml;shironi ta ndryshoni; ato mund t&euml; jen&euml; fonte, ngjyra, sfonde, etj. &Ccedil;do veti ka nj&euml; vler&euml;, p&euml;r shembull vetia e ngjyr&euml;s mund t&euml; ket&euml; vler&euml;n <code>blue</code> ose <code>#0000FF</code>, etj.</p>
            <div class="sintaksa">
<pre><code>h1 {color:blue; text-align:center;}</code></pre>
            </div>
            <p>P&euml;r ta b&euml;r&euml; CSS-n&euml; m&euml; t&euml; lexueshme, &ccedil;do deklarat&euml; mund&nbsp; ta sh&euml;noni n&euml; rresht t&euml; ri, k&euml;sisoj:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>h1 {
    color: blue;
    text-align: center;
}</code></pre>
                </div>
            </div>
            <p>N&euml; shembullin e m&euml;sip&euml;rm h1 &euml;sht&euml; selektor, <code>color</code> dhe <code>test-align</code> jan&euml; veti t&euml; CSS-s&euml;, pastaj <code>blue</code> dhe <code>center</code> jan&euml; vlerat p&euml;rkat&euml;se t&euml; k&euml;tyre vetive.</p>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Nj&euml; deklarat&euml; CSS gjithmon&euml; p&euml;rfundon me nj&euml; pik&euml;presje "<code>;</code>", dhe grupet e deklarimit jan&euml; gjithmon&euml; brenda kllapave gjarp&euml;rore "<code>{}</code>".</p>
            </div>
            <h2>Sh&euml;nimi i komenteve n&euml; CSS</h2>
            <p>Komentet zakonisht shtohen me q&euml;llim q&euml; ta b&euml;jn&euml; kodin burimor m&euml; t&euml; leht&euml; p&euml;r t'u kuptuar. Mund t&rsquo;i ndihmoj&euml; zhvilluesit tjet&euml;r (ose juve n&euml; t&euml; ardhmen kur editoni kodin burimor) t&euml; kuptojn&euml; se &ccedil;far&euml; po p&euml;rpiqeshit t&euml; b&euml;nit me CSS. Komentet jan&euml; dometh&euml;n&euml;se p&euml;r programuesit, por injorohen nga shfletuesit.</p>
            <p>Nj&euml; koment n&euml; CSS fillon me <code>/*</code> dhe p&euml;rfundon me <code>*/</code>, si&ccedil; tregohet n&euml; shembullin m&euml; posht&euml;:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>/* Ky është një koment në CSS */
h1 {
    color: blue;
    text-align: center;
}
/* Ky është koment CSS i gjatë
    në shumë rreshta */
p {
    font-size: 18px;
    text-transform: uppercase;
}</code></pre>
                </div>
            </div>
            <p>Gjithashtu mund t&euml; komentoni nj&euml; pjes&euml; t&euml; kodit tuaj CSS p&euml;r q&euml;llime korrigjimi, si&ccedil; tregohet m&euml; posht&euml;:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>h1 {
    color: blue;
    text-align: center;
}
/*
p {
    font-size: 18px;
    text-transform: uppercase;
}
*/</code></pre>
                </div>
            </div>
            <h2>Ndjeshm&euml;ria e shkronjave n&euml; CSS (<em>Case Sensivity</em>)</h2>
            <p>Emrat e vetive n&euml; CSS dhe shum&euml; vlera nuk jan&euml; t&euml; ndjeshme n&euml; shkronja t&euml; m&euml;dha. Nd&euml;rsa, selektor&euml;t e CSS-s&euml; zakonisht jan&euml; t&euml; ndjesh&euml;m n&euml; shkronja, p&euml;r shembull, selektori i klas&euml;s <code>.maincontent</code> nuk &euml;sht&euml; i nj&euml;jt&euml; me <code>.mainContent</code>.</p>
            <p>Prandaj, p&euml;r t&euml; qen&euml; m&euml; t&euml; sigurt, duhet t&euml; supozoni se t&euml; gjith&euml; komponentet e rregullave t&euml; CSS jan&euml; t&euml; ndjesh&euml;m ndaj shkronjave.</p>
        </section>

        <section id="selektoret">
            <h1>Selektor&euml;t</h1>
            <p>Selektori CSS &euml;sht&euml; nj&euml; model q&euml; p&euml;rputhet me elementet e nj&euml; ueb faqeje. Rregullat e stilit t&euml; shoq&euml;ruara me at&euml; selektor do t&euml; aplikohen n&euml; elementet q&euml; p&euml;rputhen me modelin e selektorit.</p>
            <p>Selektor&euml;t jan&euml; nj&euml; prej aspekteve m&euml; t&euml; r&euml;nd&euml;sishme t&euml; CSS-s&euml;, pasi ato ju mund&euml;sojn&euml; t&euml; p&euml;rzgjidhni elemente specifike n&euml; ueb faqen tuaj q&euml; t&euml; stilizohen n&euml; m&euml;nyra t&euml; ndryshme.</p>
            <p>Disa lloje t&euml; selektor&euml;ve CSS jan&euml; n&euml; dispozicion, le t'i hedhim nj&euml; v&euml;shtrim:</p>
            <h2>Selektori universal</h2>
            <p>Selektori universal, i sh&euml;nuar me nj&euml; yll (<code>*</code>), p&euml;rputhet me &ccedil;do element n&euml; ueb faqe.</p>
            <p>Selektori universal mund t&euml; hiqet n&euml;se ekzistojn&euml; kushte t&euml; tjera n&euml; element. Ky selektor shpesh p&euml;rdoret p&euml;r t&euml; hequr margjinat dhe mbushjet e paracaktuara nga element&euml;t me q&euml;llim t&euml; testimit t&euml; shpejt&euml;.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>* {
    margin: 0;
    padding: 0;
}</code></pre>
                </div>
            </div>
            <p>Rregullat e stilit brenda selektorit <code>*</code> do t&euml; zbatohen p&euml;r &ccedil;do element n&euml; nj&euml; dokument.</p>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Rekomandohet t&euml; <em>mos p&euml;rdorni</em> selektorin universal (<code>*</code>) shum&euml; shpesh n&euml; nj&euml; mjedis paraqitjeje, pasi q&euml; ky selektor p&euml;rputhet me &ccedil;do element n&euml; ueb faqe e q&euml; ushtron presion t&euml; panevojsh&euml;m n&euml; shfletues. N&euml; vend t&euml; tij p&euml;rdorni selektor t&euml; tipit element ose selektor t&euml; klas&euml;s.</p>
            </div>
            <h2>Selektor&euml;t e tipit t&euml; elementit</h2>
            <p>Nj&euml; selektor i tipit t&euml; elementit p&euml;rputhet me t&euml; gjitha instancat e elementit n&euml; dokument me emrin e tipit p&euml;rkat&euml;s t&euml; elementit. T&euml; provojm&euml; nj&euml; shembull p&euml;r t&euml; par&euml; se si funksionon n&euml; t&euml; v&euml;rtet&euml;:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>p {
    color: blue;
}</code></pre>
                </div>
            </div>
            <p>Rregullat e stilit brenda selektorit <code>p</code> do t&euml; zbatohen n&euml; &ccedil;do element <code>&lt;p&gt;</code> (apo paragraf) n&euml; dokument dhe e ngjyrosin at&euml; me ngjyr&euml; t&euml; kalt&euml;r (<code>blue</code>), pavar&euml;sisht nga pozicioni i tyre n&euml; pem&euml;n e dokumentit.</p>
            <h2>Selektor&euml;t ID</h2>
            <p>Selektori ID p&euml;rdoret p&euml;r t&euml; definuar rregullat e stilit p&euml;r nj&euml; element t&euml; <em>vet&euml;m</em> ose <em>unik</em>.</p>
            <p>Selektori ID definohet me shenj&euml;n (<code>#</code>), e m&euml; pas e ndjekur nga vlera e ID-s&euml;.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>#error {
    color: red;
}</code></pre>
                </div>
            </div>
            <p>Ky stil e paraqet tekstin e nj&euml; elementi me t&euml; kuqe, atributi <code>id</code> i t&euml; cilit e ka vler&euml;n <code>error</code>.</p>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Vlera e nj&euml; atributi ID duhet t&euml; jet&euml; unike brenda nj&euml; dokumenti t&euml; caktuar &ndash; q&euml; do t&euml; thot&euml; se dy element&euml; n&euml; dokumentin HTML nuk mund t&euml; ken&euml; t&euml; nj&euml;jt&euml;n vler&euml; t&euml; ID-s&euml;.</p>
            </div>
            <h2>Selektor&euml;t e klasave</h2>
            <p>Selektor&euml;t e klasave mund t&euml; p&euml;rdoren p&euml;r t&euml; zgjedhur &ccedil;do element HTML q&euml; kan&euml; atributin <code>class</code>. T&euml; gjith&euml; element&euml;t q&euml; kan&euml; at&euml; klas&euml; do t&euml; formatohen sipas rregullit t&euml; p&euml;rcaktuar.</p>
            <p>Selektori i klas&euml;s definohet me shenj&euml;n (<code>.</code>), e m&euml; pas e ndjekur nga vlera e klas&euml;s.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>.kalter {
    color: blue;
}</code></pre>
                </div>
            </div>
            <p>Rregullat e stilit t&euml; m&euml;sip&euml;rm e b&euml;jn&euml; tekstin me ngjyr&euml; t&euml; kalt&euml;r p&euml;r &ccedil;do element n&euml; dokument q&euml; posedon atributin <code>class</code> me vler&euml; <code>blue</code>. Mund ta b&euml;ni at&euml; m&euml; t&euml; ve&ccedil;ant&euml;. P&euml;r shembull:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>p.kalter {
    color: blue;
}</code></pre>
                </div>
            </div>
            <p>Stili brenda selektorit <code>p.blue</code> e b&euml;n tekstin e kalt&euml;r vet&euml;m p&euml;r elementet <code>&lt;p&gt;</code> q&euml; kan&euml; atributin <code>class</code> me vler&euml;n <code>blue</code> dhe nuk ka asnj&euml; efekt n&euml; paragraf&euml;t e tjer&euml;.</p>
            <h2>Selektor&euml;t pasardh&euml;s</h2>
            <p>Mund t'i p&euml;rdorni k&euml;to selektor&euml; kur duhet t&euml; zgjidhni nj&euml; element q&euml; &euml;sht&euml; pasardh&euml;s i nj&euml; elementi tjet&euml;r, p&euml;r shembull, n&euml;se doni t&euml; p&euml;rzgjidhni vet&euml;m ato etiketa <code>a</code> q&euml; p&euml;rmbahen n&euml; nj&euml; list&euml; t&euml; parenditur <code>ul</code>, n&euml; vend q&euml; t&euml; p&euml;rzgjidhni t&euml; gjith&euml; element&euml;t <code>a</code> n&euml; at&euml; dokument.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>ul.menu li a {
    text-decoration: none;
}
h1 em {
    color: green;
}</code></pre>
                </div>
            </div>
            <p>Rregullat e stilit brenda selektorit <code>ul.menu li a</code> zbatohen vet&euml;m p&euml;r ato elemente <code>&lt;a&gt;</code> q&euml; gjinden brenda nj&euml; elementi <code>&lt;ul&gt;</code> q&euml; ka klas&euml;n <code>.menu</code>, dhe nuk ka asnj&euml; efekt n&euml; linqet tjer&euml; brenda dokumentit.</p>
            <p>N&euml; m&euml;nyr&euml; t&euml; ngjashme, rregullat e stilit brenda selektorit <code>h1 em</code> do t&euml; zbatohen vet&euml;m p&euml;r ato elemente <code>&lt;em&gt;</code> q&euml; p&euml;rmbahen brenda elementit <code>&lt;h1&gt;</code> dhe nuk ka efekt n&euml; element&euml;t e tjer&euml; <code>&lt;em&gt;</code>.</p>
            <h2>Selektor&euml;t e f&euml;mij&euml;ve</h2>
            <p>Selektor&euml;t e f&euml;mij&euml;ve p&euml;rdoren p&euml;r t&euml; zgjedhur vet&euml;m ato elemente q&euml; jan&euml; f&euml;mij&euml;t e drejtp&euml;rdrejt&euml; t&euml; nj&euml; elementi.</p>
            <p>Selektor&euml;t e f&euml;mij&euml;ve p&euml;rb&euml;het nga dy ose m&euml; shum&euml; selektor&euml; t&euml; ndar&euml; me simbolin m&euml; i madh se (<code>&gt;</code>). Mund ta p&euml;rdorni k&euml;t&euml; selektor, p&euml;r shembull, p&euml;r t&euml; zgjedhur nivelin e par&euml; t&euml; elementeve t&euml; list&euml;s brenda nj&euml; liste t&euml; futur q&euml; ka m&euml; shum&euml; se nj&euml; nivel. Le t&euml; shikojm&euml; nj&euml; shembull p&euml;r t&euml; kuptuar se si funksionon:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>ul > li {
    list-style: square;
}
ul > li ol {
    list-style: none;
}</code></pre>
                </div>
            </div>
            <p>Rregulli i stilit brenda selektorit <code>ul &gt; li</code> zbatohet vet&euml;m p&euml;r ato element&euml; <code>&lt;li&gt;</code> q&euml; jan&euml; f&euml;mij&euml; t&euml; drejtp&euml;rdrejt&euml; t&euml; elementeve <code>&lt;ul&gt;</code> dhe nuk ka asnj&euml; efekt mbi element&euml;t e tjer&euml; t&euml; list&euml;s.</p>
            <h2>Selektor&euml;t fqinj&euml; sibling</h2>
            <p>Selektor&euml;t fqinj&euml; sibling mund t&euml; p&euml;rdoren p&euml;r t&euml; zgjedhur element&euml; n&euml; t&euml; nj&euml;jtin nivel. Ky selektor ka sintaks&euml;n k&euml;sisoj: <code>E1 + E2</code>, ku <code>E2</code> &euml;sht&euml; sh&euml;njestra e selektorit.</p>
            <p>Selektori <code>h1 + p</code> n&euml; shembullin vijues do t&euml; zgjedh&euml; elementet <code>&lt;p&gt;</code> vet&euml;m n&euml;se t&euml; dy elementet <code>&lt;h1&gt;</code> dhe <code>&lt;p&gt;</code> ndajn&euml; t&euml; nj&euml;jtin prind n&euml; pem&euml;n e dokumentit dhe <code>&lt;h1&gt;</code> i paraprin dhe &euml;sht&euml; fqinj me elementin <code>&lt;p&gt;</code>. Kjo do t&euml; thot&euml; se vet&euml;m ata paragraf&euml; q&euml; vijn&euml; menj&euml;her&euml; pas &ccedil;do titulli <code>&lt;h1&gt;</code> do t&euml; p&euml;rzgjidhen. Le t&euml; shohim se si funksionon n&euml; t&euml; v&euml;rtet&euml; ky selektor:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>h1 + p {
    color: blue;
    font-size: 18px;
}
ul.task + p {
    color: #f0f;
    text-indent: 30px;
}</code></pre>
                </div>
            </div>
            <h2>Selektor&euml;t e p&euml;rgjithsh&euml;m sibling</h2>
            <p>Selektori i p&euml;rgjithsh&euml;m sibling &euml;sht&euml; i ngjash&euml;m me selektorin fqinj sibling (<code>E1 + E2</code>), por &euml;sht&euml; m&euml; pak i rrept&euml;. Selektori i p&euml;rgjithsh&euml;m sibling p&euml;rb&euml;het nga dy selektor&euml; t&euml; thjesht&euml; t&euml; ndar&euml; nga karakteri (<code>&sim;</code>). Mund t&euml; shkruhet k&euml;sisoj: <code>E1 &sim; E2</code>, ku <code>E2</code> &euml;sht&euml; sh&euml;njestra e selektorit.</p>
            <p>Selektori <code>h1 &sim; p</code> n&euml; shembullin m&euml; posht&euml; do t&euml; zgjedh&euml; t&euml; gjith&euml; element&euml;t <code>&lt;p&gt;</code> q&euml; paraprihen nga elementi <code>&lt;h1&gt;</code>, ku t&euml; gjith&euml; element&euml;t ndajn&euml; t&euml; nj&euml;jtin prind n&euml; pem&euml;n e dokumentit.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>h1 ∼ p {
    color: blue;
    font-size: 18px;
}
ul.task ∼ p {
    color: #f0f;
    text-indent: 30px;
}</code></pre>
                </div>
            </div>
            <h2>Grupimi i selektor&euml;ve</h2>
            <p>Shpesh disa selektor&euml; n&euml; nj&euml; flet&euml; t&euml; stilit ndajn&euml; t&euml; nj&euml;jtat deklarata t&euml; rregullave t&euml; stilit. Mund t'i gruponi n&euml; nj&euml; list&euml; t&euml; ndar&euml; me presje p&euml;r t&euml; minimizuar kodin n&euml; flet&euml;n tuaj t&euml; stilit. Gjithashtu ju pamund&euml;son t&euml; p&euml;rs&euml;risni t&euml; nj&euml;jtat rregulla t&euml; stilit disa her&euml;:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>h1 {
    font-size: 36px;
    font-weight: normal;
}
h2 {
    font-size: 28px;
    font-weight: normal;
}
h3 {
    font-size: 22px;
    font-weight: normal;
}</code></pre>
                </div>
            </div>
            <p>Si&ccedil; mund ta shihni n&euml; shembullin e m&euml;sip&euml;rm, i nj&euml;jti rregull i stilit <code>font-weight: normal;</code> p&euml;rdoret nga selektor&euml;t <code>h1</code>, <code>h2</code> dhe <code>h3</code>, k&euml;shtu q&euml; mund t&euml; grupohen n&euml; nj&euml; list&euml; t&euml; ndar&euml; me presje, k&euml;sisoj:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>h1, h2, h3 {
    font-weight: normal;
}
h1 {
    font-size: 36px;
}
h2 {
    font-size: 28px;
}
h3 {
    font-size: 22px;
}</code></pre>
                </div>
            </div>

        </section>

        <section id="ngjyrat">
            <h1>Ngjyrat</h1>
            <p>Vetia e ngjyrave <code>color</code> definon ngjyr&euml;n e tekstit t&euml; nj&euml; elementi.</p>
            <p>P&euml;r shembull, vetia <code>color</code> e specifikuar n&euml; selektorin <code>body</code> definon ngjyr&euml;n e paracaktuar t&euml; tekstit p&euml;r t&euml; gjith&euml; faqen.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>body {
    color: #ff5722;
}</code></pre>
                </div>
            </div>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Vetia <code>color</code> normalisht trash&euml;gon vler&euml;n e ngjyr&euml;s nga elementi i tyre prind, p&euml;rve&ccedil; rastit t&euml; elementeve t&euml; ankorimit &ndash; linqeve. P&euml;r shembull, n&euml;se specifikoni vetin&euml; <code>color</code> n&euml; elementin <code>body</code>, ajo automatikisht do t&euml; atribuohej edhe n&euml; tituj, paragraf&euml;, etj.</p>
            </div>
            <h2>Definimi i vler&euml;s s&euml; ngjyrave</h2>
            <p>Ngjyrat n&euml; CSS specifikohen m&euml; shpesh sipas k&euml;tyre formateve:</p>
            <ul>
            <li>fjal&euml; ky&ccedil;e me ngjyra (emra t&euml; ngjyrave) &ndash; "<code>red</code>", "<code>green</code>", "<code>blue</code>", "<code>transparent</code>", etj.</li>
            <li>vlera HEX (heksadecimale) &ndash; "<code>#ff0000</code>", "<code>#00ff00</code>", etj.</li>
            <li>vlera RGB (Red-Green-Blue) &ndash; "<code>rgb(255,0,0)</code>"</li>
            </ul>
            <p>CSS3 ka prezantuar disa formate t&euml; tjera me ngjyra t&euml; tilla si HSL, HSLA dhe RGBA q&euml; gjithashtu mb&euml;shtesin transparenc&euml;n alfa.</p>
            <h3>Fjal&euml;t ky&ccedil;e t&euml; ngjyrave</h3>
            <p>CSS definon disa fjal&euml; ky&ccedil;e me ngjyra t&euml; cilat ju lejojn&euml; t&euml; specifikoni vlerat e ngjyrave n&euml; nj&euml; m&euml;nyr&euml; m&euml; t&euml; leht&euml;.</p>
            <p>K&euml;to fjal&euml; ky&ccedil;e kryesore me ngjyra jan&euml;: <code>aqua, black, blue, fuchsia, gray, green, lime, maroon, navy, olive, purple, red, silver, teal, white</code> dhe <code>yellow</code>. Emrat e ngjyrave nuk jan&euml; t&euml; ndjesh&euml;m n&euml; llojin e shkronjave q&euml; p&euml;rdoret.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>h1 {
    color: red;
}
p {
    color: purple;
}</code></pre>
                </div>
            </div>
            <p>Ueb-shfletuesit modern&euml; megjithat&euml; praktikisht mb&euml;shtesin shum&euml; m&euml; tep&euml;r emra ngjyrash sesa ato q&euml; p&euml;rcaktohen n&euml; standardin CSS, por p&euml;r t&euml; qen&euml; m&euml; t&euml; sigurt duhet t&euml; p&euml;rdorni vlera heksadecimale t&euml; ngjyrave n&euml; vend t&euml; tyre.</p>
            <h3>Vlerat e ngjyrave HEX</h3>
            <p>Hex (shkurtes&euml; p&euml;r heksadecimal) &euml;sht&euml; deri m&euml; tani metoda m&euml; e p&euml;rdorur p&euml;r definimin e ngjyrave n&euml; ueb.</p>
            <p>Hex paraqet ngjyrat duke p&euml;rdorur nj&euml; kod 6-shifror, q&euml; i paraprin&euml; karakteri hash (#), si <code>#rrggbb</code>, n&euml; t&euml; cilin <code>rr</code>, <code>gg</code> dhe <code>bb</code> p&euml;rfaq&euml;sojn&euml; p&euml;rkat&euml;sisht komponentin ngjyr&euml;s s&euml; kuqe, gjelb&euml;r dhe t&euml; kalt&euml;r.</p>
            <p>Vlera e secilit komponent mund t&euml; varioj nga <code>00</code> (pa ngjyr&euml;) deri n&euml; <code>FF</code> (ngjyra e plot&euml;) n&euml; sh&euml;nimin heksadecimal, ose nga <code>0</code> deri n&euml; <code>255</code> n&euml; sh&euml;nimin ekuivalent decimal. K&euml;sisoj <code>#ffffff</code> p&euml;rfaq&euml;son ngjyr&euml;n e bardh&euml; dhe <code>#000000</code> p&euml;rfaq&euml;son ngjyr&euml;n e zez&euml;.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>h1 {
    color: #ffa500;
}
p {
    color: #00ff00;
}</code></pre>
                </div>
            </div>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Sistemi heksadecimal ose Hex i referohet nj&euml; skeme num&euml;rimi q&euml; p&euml;rdor 16 karaktere si baz&euml; t&euml; saj. P&euml;rdor numrat 0 deri n&euml; 9 dhe shkronjat A, B, C, D, E dhe F q&euml; korrespondojn&euml; p&euml;rkat&euml;sisht me numrat dhjetor&euml; 10, 11, 12, 13, 14 dhe 15.</p>
            </div>
            <div class="keshille">
                <p><strong>K&euml;shill&euml;</strong>: N&euml;se kodi heksadecimal i nj&euml; ngjyre ka nga dy vlera t&euml; nj&euml;jta, ai gjithashtu mund t&euml; shkruhet m&euml; shkurt&euml; p&euml;r t&euml; shmangur sh&euml;nimin shtes&euml;, p&euml;r shembull, vlera e ngjyrave hex <code>#ffffff</code> mund t&euml; shkruhet edhe si <code>#fff</code>, <code>#000000</code> si <code>#000</code>, <code>#00ff00</code> si <code>#0f0</code>, <code>#ffcc00</code> si <code>#fc0</code>, e k&euml;shtu me radh&euml;.</p>
            </div>
            <h3>Vlerat e ngjyrave RGB</h3>
            <p>Ngjyrat mund t&euml; definohen edhe n&euml; modelin RGB (Red &ndash; e kuqe, Green &ndash; e gjelb&euml;r dhe Blue &ndash; e kalt&euml;r) duke p&euml;rdorur sh&euml;nimin funksional <code>rgb()</code>.</p>
            <p>Funksioni <code>rgb()</code> p&euml;rdor tri vlera t&euml; ndara me presje, t&euml; cilat specifikojn&euml; sasin&euml; e komponentit t&euml; ngjyr&euml;s s&euml; kuqe, t&euml; gjelb&euml;r dhe t&euml; kalt&euml;r. K&euml;to vlera zakonisht specifikohen si numra t&euml; plot&euml; nd&euml;rmjet 0 deri n&euml; 255, ku 0 p&euml;rfaq&euml;son <em>asnj&euml; ngjyr&euml;</em> dhe 255 p&euml;rfaq&euml;son <em>ngjyr&euml;n e plot&euml;</em> ose <em>maksimale</em>.</p>
            <p>Shembulli i m&euml;posht&euml;m specifikon t&euml; nj&euml;jt&euml;n ngjyr&euml; si n&euml; shembullin e m&euml;parsh&euml;m, por n&euml; sh&euml;nimin RGB.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>h1 {
    color: rgb(255, 165, 0);
}
p {
    color: rgb(0, 255, 0);
}</code></pre>
                </div>
              </div>
              <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Gjithashtu mund t&euml; specifikoni vlerat RGB brenda funksionit <code>rgb()</code> n&euml; p&euml;rqindje, ku <code>100%</code> p&euml;rfaq&euml;son ngjyr&euml;n e plot&euml; dhe <code>0%</code> (<em>jo thjesht <code>0</code></em>) p&euml;rfaq&euml;son asnj&euml; ngjyr&euml;. P&euml;r shembull, mund t&euml; specifikoni ngjyr&euml;n e kuqe&nbsp; <code>rgb(255,0,0)</code> ose <code>rgb(100%,0%,0%)</code>.</p>
              </div>
              <div class="keshille">
                <p><strong>K&euml;shill&euml;</strong>: N&euml;se R, G dhe B t&euml; gjitha kan&euml; vler&euml;n maksimale 255, d.m.th. <code>rgb(255,255,255)</code>, ngjyra do t&euml; jet&euml; e bardh&euml;. Po k&euml;shtu, n&euml;se t&euml; gjitha kanalet kan&euml; vler&euml;n 0, d.m.th. <code>rgb(0,0,0)</code>, ngjyra do t&euml; ishte e zez&euml;.</p>
              </div>

              <h2>Ndikimi i vetis&euml; color n&euml; kufij dhe skica</h2>
                <p>Vetia <code>color</code> nuk vlen vet&euml;m p&euml;r p&euml;rmbajtjen e tekstit, por p&euml;r &ccedil;do gj&euml; n&euml; plan t&euml; par&euml; q&euml; merr nj&euml; vler&euml; t&euml; ngjyr&euml;s. P&euml;r shembull, n&euml;se vlera e ngjyr&euml;s s&euml; kufirit (<code>border-color</code>) ose ngjyra e skic&euml;s (<code>outline-color</code>) nuk &euml;sht&euml; p&euml;rcaktuar qartazi p&euml;r elementin, n&euml; vend t&euml; k&euml;saj do t&euml; p&euml;rdoret vlera e ngjyr&euml;s nga vetia <code>color</code>.</p>
                <div class="shembull">
                    <p>Shembull:</p>
                    <div class="kodi">
<pre><code>p.nje {
    color: #0000ff;
    border: 2px solid;
}
p.dy {
    color: #00ff00;
    outline: 2px solid;
}</code></pre>
                    </div>
                  </div>

                <!-- Color Picker -->
              <div id="color-picker">
                <h3 style="text-align: center; margin-bottom: 1.6em">Zgjedhësi i ngjyrave <span>RGB dhe HEX</span></h3>
              
                <div id="display">
                  <p id="text"> 
                    <span id="dec">rgb(12,115,184)</span>
                    <span id="hex">#0C73B8</span>
                  </p>
                </div>
              
                <div id="inputet">
              
                  <div class="ngjyra">
                    <input type="range" id="red" name="red" min="0" step="1" max="255" value="12">
                    <div class="txt-ngjyra">Red: <span id="txt-red">12</span> </div>
                    <div class="txt-ngjyra">Hex: <span id="hex-red">0C</span> </div>
                  </div>
              
                  <div class="ngjyra">
                    <input type="range" id="green" name="green" min="0" step="1" max="255" value="115">
                    <div class="txt-ngjyra">Green: <span id="txt-green">115</span> </div>
                    <div class="txt-ngjyra">Hex: <span id="hex-green">73</span> </div>
                  </div>
              
                  <div class="ngjyra">
                    <input type="range" id="blue" name="blue" min="0" step="1" max="255" value="184">
                    <div class="txt-ngjyra">Blue: <span id="txt-blue">184</span> </div>
                    <div class="txt-ngjyra">Hex: <span id="hex-blue">B8</span> </div>
                  </div>
              
                </div>
            </div>

        </section>

        <section id="sfondi">
            <h1>Sfondi</h1>
            <p>Sfondi apo prapaskena luan nj&euml; rol t&euml; r&euml;nd&euml;sish&euml;m n&euml; prezantimin vizual t&euml; ueb faqeve.</p>
            <p>CSS ofron disa veti p&euml;r stilizimin e sfondit t&euml; nj&euml; elementi, p&euml;rfshir&euml; ngjyrosjen e sfondit, vendosjen e imazheve n&euml; sfond dhe menaxhimin e pozicionimit t&euml; tyre, etj.</p>
            <p>Vetit&euml; e sfondit jan&euml; <code>background-color, background-image, background-repeat, background-attachment</code> dhe <code>background-position</code>.</p>
            <h2>Ngjyra e sfondit</h2>
            <p>Vetia&nbsp; <code>background-color</code> p&euml;rdoret p&euml;r t&euml; vendosur ngjyr&euml; n&euml; sfond t&euml; nj&euml; elementi.</p>
            <p>Shembulli i m&euml;posht&euml;m tregon se si t&euml; vendosni ngjyr&euml;n n&euml; sfond t&euml; t&euml; gjith&euml; faqes.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>body {
    background-color: #f0e68c;
}</code></pre>
                </div>
              </div>
              <p>Vlerat e ngjyrave n&euml; CSS specifikohen kryesisht n&euml; formatet e m&euml;poshtme:</p>
            <ul>
                <li>me em&euml;r ngjyrash &ndash; si p.sh. "<code>red</code>"</li>
                <li>me vler&euml; HEX &ndash; si p.sh. "<code>#ff0000</code>"</li>
                <li>me vler&euml; RGB &ndash; si p.sh. "<code>rgb(255,0,0)</code>"</li>
            </ul>
            <h2>Imazhi n&euml; sfond</h2>
            <p>Vetia <code>background-image</code> vendos nj&euml; imazh n&euml; sfond t&euml; nj&euml; elementi HTML.</p>
            <p>Le t&euml; shohim shembullin vijues q&euml; vendos imazhin n&euml; sfond n&euml; t&euml; gjith&euml; faqen.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>body {
    background-image: url("foto/imazh.png");
}</code></pre>
                </div>
              </div>
              <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Kur p&euml;rdorni imazhin n&euml; sfond t&euml; nj&euml; elementi, sigurohuni q&euml; imazhi q&euml; zgjidhni nuk ndikon n&euml; lexueshm&euml;rin&euml; e p&euml;rmbajtjes s&euml; tekstit t&euml; elementit.</p>
              </div>
              <div class="keshille">
                <p><strong>K&euml;shill&euml;</strong>: N&euml; m&euml;nyr&euml; t&euml; paracaktuar shfletuesi p&euml;rs&euml;rit imazhin e sfondit si horizontalisht ashtu edhe vertikalisht p&euml;r t&euml; mbushur t&euml; gjith&euml; zon&euml;n e nj&euml; elementi. K&euml;t&euml; mund ta kontrolloni me vetin&euml; <code>background-repeat</code>.</p>
              </div>
              <h2>P&euml;rs&euml;ritja e sfondit</h2>
                <p>Vetia <code>background-repeat</code> ju lejon t&euml; kontrolloni se si nj&euml; imazh i sfondit p&euml;rs&euml;ritet ose vendoset n&euml; form&euml; t&euml; pllakave n&euml; sfondin e nj&euml; elementi. Mund t&euml; vendosni nj&euml; imazh sfondi q&euml; t&euml; p&euml;rs&euml;ritet vertikalisht (boshti y), horizontalisht (boshti x), n&euml; t&euml; dy drejtimet ose n&euml; asnj&euml; drejtim.</p>
                <p>Le t&euml; shohim shembullin vijues q&euml; demonstron se si t&euml; vendosim sfondin me gradienc&euml; p&euml;r nj&euml; ueb faqe duke p&euml;rs&euml;ritur imazhin e prer&euml; horizontalisht p&euml;rgjat&euml; boshtit x.</p>
                <div class="shembull">
                    <p>Shembull:</p>
                    <div class="kodi">
<pre><code>body {
    background-image: url("foto/gradienca.png");
    background-repeat: repeat-x;
}</code></pre>
                    </div>
                  </div>
                  <p>N&euml; m&euml;nyr&euml; t&euml; ngjashme, mund t&euml; p&euml;rdorni vler&euml;n <code>repeat-y</code> p&euml;r t&euml; p&euml;rs&euml;ritur imazhin e sfondit vertikalisht p&euml;rgjat&euml; boshtit y, ose vler&euml;n <code>no-repeat</code> p&euml;r t&euml; parandaluar p&euml;rs&euml;ritjen krejt&euml;sisht.</p>
                  <div class="shembull">
                    <p>Shembull:</p>
                    <div class="kodi">
<pre><code>body {
    background-image: url("foto/tekstura.png");
    background-repeat: no-repeat;
}</code></pre>
                    </div>
                  </div>
                  <p>Le t&euml; hedhim nj&euml; v&euml;shtrim n&euml; ilustrimin vijues p&euml;r t&euml; kuptuar se si funksionon kjo veti n&euml; t&euml; v&euml;rtet&euml;.</p>
                  <div class="img-kodi elementet-html ilustrim" style="text-align: center;">
                    <img src="foto/ilustrimi-bg-repeat-1.png" alt="Bg repeat repeat-x">
                    <img src="foto/ilustrimi-bg-repeat-2.png" alt="Bg repeat-y no-repeat">
                </div>
                <h2>Pozicioni i sfondit</h2>
                <p>Vetia <code>background-position</code> p&euml;rdoret p&euml;r t&euml; kontrolluar pozicionin e imazhit t&euml; sfondit.</p>
                <p>N&euml;se nuk &euml;sht&euml; specifikuar asnj&euml; pozicion i sfondit, imazhi i sfondit vendoset n&euml; pozicionin e paracaktuar lart-majtas t&euml; elementit d.m.th. n&euml; <code>(0,0)</code>, le t&euml; provojm&euml; &nbsp;me shembullin vijues:</p>
                <div class="shembull">
                    <p>Shembull:</p>
                    <div class="kodi">
<pre><code>body {
    background-image: url("foto/roboti.png");
    background-repeat: no-repeat;
}</code></pre>
                    </div>
                </div>
                <p>N&euml; shembullin vijues, imazhi i sfondit &euml;sht&euml; pozicionuar n&euml; cepin e sip&euml;rm nga ana e djatht&euml;.</p>
                <div class="shembull">
                    <p>Shembull:</p>
                    <div class="kodi">
<pre><code>body {
    background-image: url("foto/roboti.png");
    background-repeat: no-repeat;
    background-position: right top;
}</code></pre>
                    </div>
                </div>
                <div class="shenim">
                    <p><strong>Sh&euml;nim</strong>: N&euml;se specifikohen dy vlera p&euml;r vetin&euml; e pozicionit t&euml; sfondit, vlera e par&euml; p&euml;rfaq&euml;son pozicionin horizontal dhe e dyta p&euml;rfaq&euml;son pozicionin vertikal. N&euml;se specifikohet vet&euml;m nj&euml; vler&euml;, vlera e dyt&euml; supozohet t&euml; jet&euml; n&euml; qend&euml;r.</p>
                </div>
                <p>P&euml;rve&ccedil; fjal&euml;ve ky&ccedil;e p&euml;r pozicionim, gjithashtu p&euml;r k&euml;t&euml; veti mund t&euml; p&euml;rdorni vlera t&euml; p&euml;rqindjes ose t&euml; gjat&euml;sis&euml;, t&euml; tilla si <code>px</code> ose <code>em</code>.</p>
                <p>Le t&euml; hedhim nj&euml; v&euml;shtrim n&euml; ilustrimet vijuese p&euml;r t&euml; kuptuar se si funksionon kjo veti n&euml; t&euml; v&euml;rtet&euml;.</p>
                <div class="img-kodi elementet-html desktop-image" style="text-align: center;">
                    <img src="foto/ilustrimi-bg-position.png" alt="Bg position">
                </div>
                <div class="img-kodi elementet-html mobile-image" style="text-align: center;">
                    <img src="foto/ilustrimi-bg-position-1-mob.png" alt="Bg position 1">
                    <img src="foto/ilustrimi-bg-position-2-mob.png" alt="Bg position 2">
                </div>
                <h2>Shtojca e sfondit</h2>
                <p>Vetia <code>background-attachment</code> p&euml;rcakton n&euml;se imazhi i sfondit &euml;sht&euml; i fiksuar n&euml; lidhje me port&euml;n e shikimit ose bartet s&euml; bashku me bllokun q&euml; p&euml;rmban.</p>
                <p>Le t&euml; shohim shembullin vijues p&euml;r t&euml; kuptuar se si funksionon:</p>
                <div class="shembull">
                    <p>Shembull:</p>
                    <div class="kodi">
<pre><code>body {
    background-image: url("foto/imazh.png");
    background-repeat: no-repeat;
    background-attachment: fixed;
}</code></pre>
                    </div>
                </div>
                <h2>Vetia e shkurt p&euml;r sfond</h2>
                <p>Si&ccedil; mund ta shihni n&euml; shembujt e m&euml;sip&euml;rm, ka disa veti p&euml;r t'u marr&euml; parasysh kur merreni me sfondet. Sidoqoft&euml;, &euml;sht&euml; gjithashtu e mundur t&euml; specifikohen t&euml; gjitha k&euml;to veti n&euml; nj&euml; veti t&euml; vetme p&euml;r ta shkurtuar kodin ose p&euml;r t&rsquo;iu shmangur sh&euml;nimit shtes&euml;.</p>
                <p>Vetia background &euml;sht&euml; nj&euml; veti e shkurt&euml;r p&euml;r vendosjen e t&euml; gjitha ve&ccedil;orive individuale t&euml; sfondit, dmth. p&euml;r nj&euml; her&euml; mund t&euml; shkruhen vetit&euml; e lartp&euml;rmendura, <code>background-color, background-image, background-repeat, background-attachment</code> dhe <code>background-position</code>. Le t&euml; shohim se si funksionon kjo:</p>
                <div class="shembull">
                    <p>Shembull:</p>
                    <div class="kodi">
<pre><code>body {
    background-color: #f0e68c;
    background-image: url("foto/imazhi.png");
    background-repeat: no-repeat;
    background-attachment: fixed;
    background-position: 250px 25px;
}</code></pre>
                    </div>
                </div>
                <p>Duke p&euml;rdorur sh&euml;nimin e shkurt&euml;r, shembulli i m&euml;sip&euml;rm mund t&euml; sh&euml;nohet k&euml;sisoj:</p>
                <div class="shembull">
                    <p>Shembull:</p>
                    <div class="kodi">
<pre><code>body {
    background: #f0e68c url("foto/imazhi.png") no-repeat fixed 250px 25px;
}</code></pre>
                    </div>
                </div>
                <p>Kur p&euml;rdorni vetin&euml; <code>background</code> radhitja e vlerave t&euml; vetive duhet t&euml; jet&euml; k&euml;sisoj:</p>
                <div class="sintaksa">
<pre><code>background: <em>ngjyra imazhi përsëritja shtojca pozicioni</em>;</code></pre>
                </div>
                <p>N&euml;se vlera p&euml;r nj&euml; veti individuale t&euml; sfondit mungon ose nuk &euml;sht&euml; specifikuar gjat&euml; p&euml;rdorimit t&euml; sh&euml;nimit t&euml; shkurt&euml;r, vlera e paracaktuar p&euml;r at&euml; veti do t&euml; p&euml;rdoret.</p>
                <div class="shenim">
                    <p><strong>Sh&euml;nim</strong>: Vetit&euml; e sfondit nuk trash&euml;gohen sikur vetia e ngjyrave, por sfondi i elementit prind do t&euml; jet&euml; i duksh&euml;m si parazgjedhje, p&euml;r shkak t&euml; vler&euml;s iniciuese ose t&euml; paracaktuar <code>transparent</code> t&euml; vetis&euml; CSS <code>background-color</code>.</p>
                </div>

        </section>

        <section id="fontet">
            <h1>Fontet</h1>
            <p>Zgjedhja e fontit (llojit t&euml; shkronjave) dhe stilit t&euml; duhur &euml;sht&euml; shum&euml; e r&euml;nd&euml;sishme p&euml;r lexueshm&euml;rin&euml; e tekstit n&euml; nj&euml; faqe.</p>
            <p>CSS ofron disa veti p&euml;r stilizim t&euml; fontit t&euml; tekstit, duke p&euml;rfshir&euml; ndryshimin e pamjes s&euml; tyre, kontrollimin e madh&euml;sis&euml; dhe trash&euml;sin&euml; e tyre, pastaj menaxhimin e variantit, etj.</p>
            <p>Vetit&euml; e fonteve jan&euml;:<code> font-family, font-style, font-weight, font-size</code> dhe <code>font-variant</code>.</p>
            <h2>Familja e fontit</h2>
            <p>Vetia <code>font-family</code> p&euml;rdoret p&euml;r t&euml; specifikuar fontin q&euml; do t&euml; p&euml;rdoret p&euml;r t&euml; paraqitur tekstin.</p>
            <p>Kjo veti mund t&euml; p&euml;rmbaj&euml; disa emra t&euml; fonteve t&euml; ndara me presje si nj&euml; sistem <em>fallback</em>, k&euml;shtu q&euml; n&euml;se fonti i par&euml; nuk &euml;sht&euml; i disponuesh&euml;m n&euml; sistemin e p&euml;rdoruesit, shfletuesi p&euml;rpiqet t&euml; p&euml;rdor&euml; t&euml; dytin e k&euml;shtu me radh&euml;.</p>
            <p>Prandaj, radhitni fontin q&euml; d&euml;shironi t&euml; jet&euml; i pari, pastaj &ccedil;do font tjet&euml;r q&euml; mund t&euml; plot&euml;sohet n&euml;se fonti i par&euml; nuk &euml;sht&euml; i disponuesh&euml;m. N&euml; fund duhet ta p&euml;rfundoni list&euml;n me nj&euml; familje t&euml; p&euml;rgjithshme t&euml; fonteve t&euml; cilat jan&euml; pes&euml; &ndash; <code>serif, sans-serif, monospace, cursive</code> dhe <code>fantasy</code>. Nj&euml; deklarat&euml; tipike e familjes s&euml; fonteve mund t&euml; duket k&euml;sisoj:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>body {
    font-family: Arial, Helvetica, sans-serif;
}</code></pre>
                </div>
            </div>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: N&euml;se emri i nj&euml; familje t&euml; fonteve p&euml;rmban m&euml; shum&euml; se nj&euml; fjal&euml;, ajo duhet t&euml; vendoset brenda thonj&euml;zave, si p.sh. "Times New Roman", "Courier New", "Segoe UI", etj.</p>
            </div>
            <p>Familjet e fonteve zakonisht t&euml; p&euml;rdorura n&euml; ueb faqe jan&euml; <em>serif</em> dhe <em>sans-serif</em>, sepse jan&euml; m&euml; t&euml; p&euml;rshtatshme p&euml;r lexim. Nd&euml;rsa fontet <em>monospace</em> p&euml;rdoren zakonisht p&euml;r t&euml; paraqitur kodin, pasi n&euml; k&euml;t&euml; lloj shkrimi &ccedil;do shkronj&euml; z&euml; t&euml; nj&euml;jt&euml;n hap&euml;sir&euml; e cila duket si tekst i shkruar.</p>
            <p>Fontet <em>cursive</em> duken si shkrim kursiv ose shkrim dore. Fonti <em>fantasy</em> p&euml;rfaq&euml;son font artistik, por k&euml;to lloj fonte nuk p&euml;rdoren gjer&euml;sisht p&euml;r shkak t&euml; disponueshm&euml;ris&euml; s&euml; dob&euml;t n&euml; t&euml; gjith&euml; sistemet operative.</p>
            <h3>Dallimi n&euml; mes fonteve serif dhe sans-serif</h3>
            <p>Fontet <em>serif</em> kan&euml; vij&euml; t&euml; vog&euml;l ose kthesa n&euml; skajet e karaktereve, nd&euml;rsa fontet <em>sans-serif</em> jan&euml; m&euml; t&euml; drejta dhe nuk i kan&euml; k&euml;to vija dhe kthesa t&euml; vogla n&euml; skaje. Shihni ilustrimin vijues.</p>
            <div class="" style="text-align: center;">
                <img src="foto/serif-vs-sans-serif.png" alt="Serif vs sans-serif">
            </div>
            <h2>Stili i fontit</h2>
            <p>Vetia <code>font-style</code> p&euml;rdoret p&euml;r t&euml; vendosur stilin e shkronjave n&euml; p&euml;rmbajtjen e tekstit t&euml; nj&euml; elementi.</p>
            <p>Stili i fontit mund t&euml; jet&euml; <code>normal, italic</code> ose <code>oblique</code>. Vlera e paracaktuar &euml;sht&euml; <code>normal</code>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>p.normal {
    font-style: normal;
}
p.pjerret {
    font-style: italic;
}
p.zhdrejt {
    font-style: oblique;
}</code></pre>
                </div>
            </div>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: N&euml; shikim t&euml; par&euml; t&euml; dy stilet <code>oblique</code> dhe <code>italic</code> shfaqin t&euml; nj&euml;jtin gj&euml;, por ekziston nj&euml; dallim. Stili <code>italic</code> p&euml;rdor nj&euml; <em>version t&euml; pjerrt&euml;</em> t&euml; fontit nd&euml;rsa <em>stili i zhdrejt&euml;</em> nga ana tjet&euml;r &euml;sht&euml; thjesht nj&euml; <em>version i pjerr&euml;t</em> ose i zhdrejt&euml; i fontit normal.</p>
            </div>
            <h2>Madh&euml;sia e fontit</h2>
            <p>Vetia <code>font-size</code> p&euml;rdoret p&euml;r t&euml; caktuar madh&euml;sin&euml; e fontit n&euml; p&euml;rmbajtjen e tekstit t&euml; nj&euml; elementi.</p>
            <p>Ekzistojn&euml; disa m&euml;nyra p&euml;r t&euml; specifikuar vlerat e madh&euml;sis&euml; s&euml; fontit, p.sh. me fjal&euml; ky&ccedil;e, p&euml;rqindje, piksell, em, etj.</p>
            <h3>Madh&euml;sia e fontit me piksell</h3>
            <p>Vendosja e madh&euml;sis&euml; s&euml; fonit n&euml; vlera piksell (p.sh. 14px, 16px, etj.) &euml;sht&euml; nj&euml; zgjedhje e mir&euml; kur keni nevoj&euml; p&euml;r sakt&euml;sin&euml; e piksell&euml;ve. Piksell &euml;sht&euml; nj&euml; nj&euml;si mat&euml;se absolute e cila specifikon nj&euml; gjat&euml;si fikse.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>h1 {
    font-size: 24px;
}
p {
    font-size: 14px;
}</code></pre>
                </div>
            </div>
            <p>Definimi i madh&euml;sive t&euml; fontit me piksell nuk konsiderohet shum&euml; i arritsh&euml;m, sepse p&euml;rdoruesi nuk mund t&euml; ndryshoj&euml; madh&euml;sin&euml; e shkronjave nga cil&euml;simet e shfletuesit. P&euml;r shembull, personat me shikim t&euml; kufizuar ose t&euml; ul&euml;t mund t&euml; d&euml;shirojn&euml; t&euml; zmadhojn&euml; madh&euml;sin&euml; e fontit m&euml; shum&euml; se madh&euml;sia e specifikuar nga ju.</p>
            <p>Prandaj, duhet t&euml; shmangni p&euml;rdorimin e vlerave piksell dhe t&euml; p&euml;rdorni vlerat q&euml; jan&euml; relative n&euml; raport me madh&euml;sin&euml; e paracaktuar t&euml; fontit nga p&euml;rdoruesi.</p>
            <div class="keshille">
                <p><strong>K&euml;shill&euml;</strong>: Teksti mund t&euml; ridimensionohet gjithashtu tek t&euml; gjith&euml; shfletuesit duke p&euml;rdorur <em>ve&ccedil;orin&euml; e zmadhimit (zoom)</em>. Sidoqoft&euml;, kjo ve&ccedil;ori ndryshon p&euml;rmasat e t&euml;r&euml; faqes, jo vet&euml;m t&euml; tekstit. W3C rekomandon p&euml;rdorimin e vlerave em ose p&euml;rqindje (%) n&euml; m&euml;nyr&euml; q&euml; t&euml; krijohen paraqitje m&euml; t&euml; fuqishme dhe t&euml; shkall&euml;zuara.</p>
            </div>
            <h3>Madh&euml;sia e fontit me EM</h3>
            <p>Nj&euml;sia <code>em</code> i referohet madh&euml;sis&euml; s&euml; shkronjave t&euml; elementit prind. Kur p&euml;rcaktohet vetia <code>font-size</code>, <code>1em</code> &euml;sht&euml; e barabart&euml; me madh&euml;sin&euml; e fontit q&euml; vlen p&euml;r <em>prindin e elementit</em>.</p>
            <p>Pra, n&euml;se caktoni <code>font-size</code> me vler&euml; <code>20px</code> n&euml; elementin e trupit, at&euml;her&euml; <code>1em = 20px</code> dhe <code>2em = 40px</code>.</p>
            <p>Sidoqoft&euml;, n&euml;se nuk e keni caktuar madh&euml;sin&euml; e fontit askund n&euml; faqe, at&euml;her&euml; vlera &euml;sht&euml; e parazgjedhur nga shfletuesi, q&euml; normalisht &euml;sht&euml; <code>16px</code>. Prandaj, n&euml; m&euml;nyr&euml; t&euml; paracaktuar <code>1em = 16px</code> dhe <code>2em = 32px</code>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>h1 {
    font-size: 2em;      /* 32px/16px=2em */
}
p {
    font-size: 0.875em;  /* 14px/16px=0.875em */
}</code></pre>
                </div>
            </div>
            <h3>Kombinimi i p&euml;rqindjes dhe EM</h3>
            <p>Si&ccedil; e keni v&euml;rejtur n&euml; shembullin e m&euml;sip&euml;rm, llogaritja e vlerave em nuk duket e thjesht&euml;. P&euml;r ta thjeshtuar k&euml;t&euml;, nj&euml; teknik&euml; e njohur &euml;sht&euml; vendosja e <code>font-size</code> p&euml;r elementin <code>body</code> n&euml; <code>62.5%</code> (q&euml; &euml;sht&euml; 62.5% e 16px t&euml; paracaktuara), e cila barazohet me <code>10px</code> ose <code>0.625em</code>.</p>
            <p>Tani mund t&euml; caktoni <code>font-size</code> p&euml;r &ccedil;do element duke p&euml;rdorur nj&euml;sin&euml; <code>em</code>, me nj&euml; konvertim t&euml; leht&euml; p&euml;r tu mbajtur mend, duke e ndar&euml; vler&euml;n <code>px</code> me <code>10</code>. N&euml; k&euml;t&euml; m&euml;nyr&euml; <code>10px = 1em</code>, <code>12px = 1.2em</code>, <code>14px = 1.4em</code>, <code>16px = 1.6em</code>, e k&euml;shtu me radh&euml;.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>body {
    font-size: 62.5%;    /* font-size 1em = 10px */
}
p {
    font-size: 1.4em;    /* 1.4em = 14px */
}
p span {
    font-size: 2em;      /* 2em = 28px */
}</code></pre>
                </div>
            </div>
            <h3>Madh&euml;sia e fontit me Root EM</h3>
            <p>P&euml;r t'i b&euml;r&euml; gj&euml;rat edhe m&euml; t&euml; thjeshta CSS3 ka prezantuar nj&euml;sin&euml; rem (shkurtes&euml; e "root em") q&euml; &euml;sht&euml; gjithmon&euml; relative me <code>font-size</code> t&euml; elementit rr&euml;nj&euml; (<code>html</code>), pavar&euml;sisht se ku q&euml;ndron elementi n&euml; dokument (ndryshe nga <code>em</code> q&euml; &euml;sht&euml; relativ me madh&euml;sin&euml; e fontit t&euml; elementit prind).</p>
            <p>Kjo do t&euml; thot&euml; q&euml; <code>1rem</code> &euml;sht&euml; ekuivalent me madh&euml;sin&euml; e fontit t&euml; elementit <code>html</code>, q&euml; &euml;sht&euml; <code>16px</code> si parazgjedhje n&euml; shumic&euml;n e ueb-shfletuesve.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>html {
    font-size: 62.5%;    /* font-size 1em = 10px */
}
p {
    font-size: 1.4rem;   /* 1.4rem = 14px */
}
p span {
    font-size: 2rem;     /* 2rem = 20px (e jo 28px) */
}</code></pre>
                </div>
            </div>
            <h3>Madh&euml;sia e fontit me fjal&euml; ky&ccedil;e</h3>
            <p>CSS ofron disa fjal&euml; ky&ccedil;e q&euml; mund t&euml; p&euml;rdorni p&euml;r t&euml; p&euml;rcaktuar madh&euml;sit&euml; e fonteve.</p>
            <p>Nj&euml; madh&euml;si absolute e fontit mund t&euml; specifikohet duke p&euml;rdorur nj&euml; nga k&euml;to fjal&euml; ky&ccedil;e: <code>xx-small, x-small, small, medium, large, x-large, xx-large</code>. Nd&euml;rsa, madh&euml;sia relative e fontit mund t&euml; specifikohet duke p&euml;rdorur fjal&euml;t ky&ccedil;e: <code>smaller</code> ose <code>larger</code>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>body {
    font-size: large;
}
h1 {
    font-size: larger;
}
p {
    font-size: smaller;
}</code></pre>
                </div>
            </div>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Fjala ky&ccedil;e medium &euml;sht&euml; ekuivalente me madh&euml;sin&euml; e paracaktuar t&euml; fontit t&euml; ueb-shfletuesve, e cila normalisht &euml;sht&euml; <code>16px</code>. Po k&euml;shtu, <code>xx-small</code> &euml;sht&euml; ekuivalent me <code>9px</code>, <code>x-small</code> &euml;sht&euml; <code>10px</code>, <code>small</code> &euml;sht&euml; <code>13px</code>, <code>large</code> &euml;sht&euml; <code>18px</code>, <code>x-large</code> &euml;sht&euml; <code>24px</code>, dhe <code>xx-large</code> &euml;sht&euml; <code>32px</code>.</p>
            </div>
            <div class="keshille">
                <p><strong>K&euml;shill&euml;</strong>: Pasi keni vendosur nj&euml; madh&euml;si t&euml; fontit n&euml; elementin <code>body</code>, m&euml; pas mund t&euml; vendosni madh&euml;sin&euml; relative t&euml; fontit kudo tjet&euml;r n&euml; faqe, duke ju dh&euml;n&euml; mund&euml;sin&euml; t&euml; shkall&euml;zoni me leht&euml;si madh&euml;sin&euml; e fontit lart ose posht&euml; n&euml; p&euml;rputhje me rrethanat.</p>
            </div>
            <h3>Madh&euml;sia e fontit me nj&euml;sit&euml; Viewport</h3>
            <p>Madh&euml;sit&euml; e fontit mund t&euml; specifikohen edhe duke p&euml;rdorur nj&euml;sit&euml; viewport (hap&euml;sira e pamjes), si&ccedil; jan&euml; <code>vw</code> ose <code>vh</code>.</p>
            <p>Nj&euml;sia viewport i referohet p&euml;rqindjes s&euml; dimensioneve t&euml; pamjes s&euml; shfletuesit, ku <code>1vw = 1%</code> e gjer&euml;sis&euml; s&euml; viewport-it dhe <code>1vh = 1%</code> e lart&euml;sis&euml; s&euml; viewport-it. Andaj, n&euml;se viewport &euml;sht&euml; <code>1600px</code> e gjer&euml;, <code>1vw</code> &euml;sht&euml; <code>16px</code>.</p>
            <p>Provoni shembullin e m&euml;posht&euml;m duke ndryshuar madh&euml;sin&euml; e dritares s&euml; shfletuesit dhe shikoni se si funksionon:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>body {
    font-size: 1vw;
}
h1 {
    font-size: 3vw;
}</code></pre>
                </div>
            </div>
            <p>Sidoqoft&euml;, ekziston nj&euml; problem me nj&euml;sit&euml; viewport. N&euml; ekranet e vogla, shkronjat b&euml;hen aq shum&euml; t&euml; vogla sa nuk mund t&euml; lexohen. P&euml;r t&euml; parandaluar k&euml;t&euml; mund t&euml; p&euml;rdorni funksionin CSS <code>calc()</code>, k&euml;sisoj:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>html { 
    font-size: calc(1em + 1vw); 
}
h1 {
    font-size: 3rem;
}</code></pre>
                </div>
            </div>
            <p>N&euml; k&euml;t&euml; shembull, edhe n&euml;se gjer&euml;sia e viewport-it b&euml;het <code>0</code>, madh&euml;sia e fontit do t&euml; jet&euml; s&euml; paku <code>1em</code> ose <code>16px</code>.</p>
            <h2>Trash&euml;sia e fontit</h2>
            <p>Vetia <code>font-weight</code> p&euml;rcakton r&euml;nd&euml;sin&euml; ose trash&euml;sin&euml; e fontit.</p>
            <p>Kjo veti mund t&euml; marr&euml; nj&euml; nga k&euml;to vlera:<code> normal, bold, bolder, lighter, 100, 200, 300, 400, 500, 600, 700, 800, 900</code> dhe <code>inherit</code>.</p>
            <p>Vlerat numerike <code>100 &ndash; 900</code> specifikojn&euml; trash&euml;sin&euml; e fontit, ku secili num&euml;r p&euml;rfaq&euml;son nj&euml; trash&euml;si m&euml; t&euml; madhe se paraardh&euml;si i tij. <code>400</code> &euml;sht&euml; e nj&euml;jt&euml; me <code>normal</code> dhe <code>700</code> &euml;sht&euml; e nj&euml;jt&euml; me <code>bold</code>.</p>
            <p>Vlerat <code>bolder</code> dhe <code>lighter</code> jan&euml; relative me trash&euml;sin&euml; e trash&euml;guar t&euml; fontit, nd&euml;rsa vlerat e tjera si <code>normal</code> dhe <code>bold</code> jan&euml; vlera absolute t&euml; trash&euml;sis&euml; s&euml; fontit.</p>
            <p>Le t&euml; provojm&euml; nj&euml; shembull p&euml;r t&euml; kuptuar se si funksionon kjo veti n&euml; thelb:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>p {
    font-weight: bold;
}</code></pre>
                </div>
            </div>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Shumica e fonteve jan&euml; n&euml; dispozicion vet&euml;m n&euml; nj&euml; num&euml;r t&euml; kufizuar t&euml; trash&euml;sive; shpesh ato jan&euml; n&euml; dispozicion vet&euml;m me vlerat <em>normal</em> dhe <em>bold</em>. N&euml; rast se nj&euml; font nuk &euml;sht&euml; i disponuesh&euml;m me trash&euml;sin&euml; e specifikuar, do t&euml; zgjidhet nj&euml; alternativ&euml; q&euml; &euml;sht&euml; trash&euml;sia m&euml; e af&euml;rt n&euml; dispozicion.</p>
            </div>
            <h2>Variant i fontit</h2>
            <p>Vetia <code>font-variant</code> lejon q&euml; teksti t&euml; shfaqet n&euml; nj&euml; variant t&euml; ve&ccedil;ant&euml; t&euml; shkronjave t&euml; vogla (small-caps).</p>
            <p>Small-caps ose <em>shkronjat e vogla kapitale</em> jan&euml; paksa t&euml; ndryshme nga shkronjat e m&euml;dha normale, n&euml; t&euml; cilat shkronjat e vogla shfaqen si versione m&euml; t&euml; vogla t&euml; shkronjave t&euml; m&euml;dha p&euml;rkat&euml;se.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>p {
    font-variant: small-caps;
}</code></pre>
                </div>
            </div>
            <p>Vlera <code>normal</code> heq shkronjat e vogla nga teksti i cili tashm&euml; &euml;sht&euml; formatuar n&euml; at&euml; m&euml;nyr&euml;.</p>
        </section>

    </main>

</div>

<footer>
    <p>&copy; Copyright <a href="https://amemeti.netlify.app" target="_blank">Abaz Memeti</a> MMXXI</p>
</footer>
    <div class="btn-bottom">
        <div id="btn-bottom">
        Përmbajtja
        </div>
    </div>
</div>

<script src="../script/script.js"></script>
<script src="script/script.js"></script>
</body>
</html>