<!DOCTYPE html>
<html lang="sq">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="shortcut icon" type="image/x-icon" href="../foto/icon.png" />
    <link rel="stylesheet" href="../style/default.css">
    <link rel="stylesheet" href="../style/global.css">
    <link rel="stylesheet" href="style/style.css">
    <link rel="stylesheet" href="../style/nata.css">
    <script src="../script/highlight.js"></script>
    <script>hljs.initHighlightingOnLoad();</script>
    <title>JavaScript</title>
</head>
<body>
<div id="grid">
    
<div id="navigimi">
    <header>
        <div class="logo"><a href="/">VEGLAT SOFTUERIKE</a></div>
        <div id="burger">
            <span class="viza"></span>
            <span class="viza"></span>
            <span class="viza"></span>
        </div>
    </header>

    <nav>
        <a href="../html/">HTML</a>
        <a href="../css/">CSS</a>
        <a href="#">JavaScript</a>
        <a href="../sql/">SQL</a>
        <div id="nata" title="Modi i errët/ndritshëm">
            <img id="img-logo" src="foto/hena.svg">
        </div>
    </nav>
</div>

<div id="wrapper">
    <article>
        <h3>REFERENCA</h3>
        <ul>
            <li><a href="https://www.w3schools.com/js/default.asp" target="_blank">w3Schools.com</a></li>
            <li><a href="https://www.guru99.com/interactive-javascript-tutorials.html" target="_blank">guru99.com</a></li>
            <li><a href="https://javascript.info/" target="_blank">javascript.info</a></li>
            <li><a href="https://developer.mozilla.org/en-US/docs/Learn/JavaScript" target="_blank">developer.mozilla.org</a></li>
            <li><a href="https://www.javatpoint.com/javascript-tutorial" target="_blank">javaTpoint.com</a></li>
            <li><a href="https://www.codecademy.com/learn/introduction-to-javascript" target="_blank">codecademy.com</a></li>
            <li><a href="https://www.javascripttutorial.net/" target="_blank">javascripttutorial.net</a></li>
            <li><a href="https://www.learn-js.org/" target="_blank">learn-js.org</a></li>
            <li><a href="https://www.coderepublics.com/JavaScript/JavaScript-tutorial.php" target="_blank">codeRepublics.com</a></li>
            <li><a href="https://www.freecodecamp.org/learn/javascript-algorithms-and-data-structures/basic-javascript/" target="_blank">freeCodeCamp.org</a></li>
            <li><a href="https://www.sololearn.com/learning/1024" target="_blank">soloLearn.com</a></li>
            <li><a href="https://scrimba.com/learn/introtojavascript" target="_blank">scrimba.com</a></li>
        </ul>
    </article>

    <aside>
        <h3>JavaScript</h3>
        <ul>
            <li><a href="#javascript-njohuri-themelore">Njohuri themelore</a></li>
            <li><a href="#ueb-sherbimet">Ueb shërbimet</a></li>
            <li><a href="#gjuhet-skriptuese">Gjuhët skriptuese</a></li>
            <li><a href="#hyrje-ne-javascript">Hyrje në JavaScript</a></li>
            <li><a href="#sintaksa">Sintaksa e JavaScript-it</a></li>
            <li><a href="#variablat">Variablat</a></li>
            <li><a href="#gjenerimi-i-rezultateve">Gjenerimi i rezultateve</a></li>
            <li><a href="#tipet-e-te-dhenave">Tipet e të dhënave</a></li>
            <li><a href="#operatoret">Operatorët</a></li>
            <li><a href="#eventet">Ngjarjet (eventet)</a></li>
        </ul>
    </aside>

    <main>

        <section id="javascript-njohuri-themelore">
            <h1>JavaScript &ndash; Njohuri themelore</h1>
            <p><strong>JavaScript</strong> &euml;sht&euml; <strong>gjuhë programimi</strong> ose gjuh&euml; skriptimi p&euml;r Ueb, e cila mund t&euml; p&euml;rdit&euml;soj dhe ndryshoj&euml; si HTML-n&euml; ashtu edhe CSS-n&euml;, e gjithashtu mund t&euml; kryej llogaritje, manipuloj&euml; dhe validoj t&euml; dh&euml;nat.</p>
            <div class="figure jonata">
                <img src="foto/js.png" alt="JavaScript">
            </div>
            <p>Skriptimi nga ana e klientit u referohet skripteve q&euml; ekzekutohen brenda shfletuesit tuaj t&euml; internetit. JavaScript &euml;sht&euml; krijuar p&euml;r t&euml; shtuar nd&euml;rveprim dhe efekte dinamike n&euml; ueb-faqe duke manipuluar p&euml;rmbajtjen q&euml; vije nga nj&euml; ueb-server.</p>
            <p>JavaScript u zhvillua fillimisht si LiveScript nga Netscape n&euml; mes t&euml; viteve 1990-ta. M&euml; von&euml; u riem&euml;rua n&euml; JavaScript n&euml; vitin 1995 dhe u b&euml; nj&euml; standard ECMA n&euml; vitin 1997. Tani JavaScript &euml;sht&euml; gjuha standarde e skriptimit nga ana e klientit p&euml;r aplikacione t&euml; bazuara n&euml; ueb, dhe p&euml;rkrahet nga pothuajse t&euml; gjith&euml; ueb- shfletuesit &nbsp;t&euml; disponuesh&euml;m sot, t&euml; tilla si Google Chrome, Mozilla Firefox, Apple Safari, etj.</p>
            <p>JavaScript &euml;sht&euml; nj&euml; gjuh&euml; e orientuar n&euml; objekte, dhe gjithashtu ka disa ngjashm&euml;ri n&euml; sintaks&euml; me gjuh&euml;n programuese Java. Megjithat&euml;, JavaScript nuk ka lidhshm&euml;ri me Java n&euml; asnj&euml; m&euml;nyr&euml;.</p>
            <p>JavaScript mir&euml;mbahet zyrtarisht nga ECMA (<em>European Computer Manufacturers Association &ndash; Shoqata Evropiane e Prodhuesve t&euml; Kompjuter&euml;ve</em>) si ECMAScript. ECMAScript 6 (ose ES6) &euml;sht&euml; versioni i fundit i standardit ECMAScript.</p>
            <h2>&Ccedil;far&euml; mund t&euml; b&euml;ni me JavaScript?</h2>
            <p>Shum&euml; gj&euml;ra mund t&euml; b&euml;ni me JavaScript.</p>
            <ul>
            <li>Mund t&euml; modifikoni p&euml;rmbajtjen e nj&euml; ueb-faqeje duke shtuar ose hequr elemente.</li>
            <li>Mund t&euml; ndryshoni stilin dhe pozicionin e elementeve n&euml; nj&euml; ueb-faqe.</li>
            <li>Mund t&euml; monitoroni ngjarje (<em>events</em>) si klikimi i miut, hover efekti, etj. dhe t&euml; reagosh ndaj tij.</li>
            <li>Mund t&euml; kryeni dhe kontrolloni tranzicionet dhe animacionet.</li>
            <li>Mund t&euml; krijoni dritare <em>pop-up</em> p&euml;r t&euml; shfaqur informacione ose mesazhe paralajm&euml;ruese tek p&euml;rdoruesi.</li>
            <li>Mund t&euml; kryeni operacione t&euml; bazuar nga futja e t&euml; dh&euml;nave nga p&euml;rdoruesit dhe t&rsquo;i shfaqni rezultatet.</li>
            <li>Mund t&euml; validoni sh&euml;nimet e p&euml;rdorueseve p&euml;rpara se t&rsquo;i paraqisni ato n&euml; server.</li>
            </ul>
            <p>Lista nuk p&euml;rfundon k&euml;tu, ka shum&euml; gj&euml;ra t&euml; tjera interesante q&euml; mund t&euml; b&euml;ni me JavaScript. Ju do t&euml; m&euml;soni p&euml;r t&euml; gjitha n&euml; detaje n&euml; kapitujt e ardhsh&euml;m.</p>
        </section>

        <section id="ueb-sherbimet">
            <h1>Ueb sh&euml;rbimet</h1>
            <h2>Ueb serveri</h2>
            <p><strong>Ueb serveri&nbsp;</strong>&euml;sht&euml; nj&euml; kompjuter ku ruhet p&euml;rmbajtja e uebit.&nbsp;N&euml; thelb ueb serveri p&euml;rdoret p&euml;r t&euml; ruajtur (<em>hostuar</em>) ueb-sajtet, gjithashtu ekzistojn&euml; ueb server&euml; t&euml; tjer&euml; p&euml;r t&euml; hostuar loj&euml;ra, hap&euml;sira ruajt&euml;se, FTP, email, etj.&nbsp;</p>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Ueb sajti &euml;sht&euml; koleksion i ueb faqeve nd&euml;rsa&nbsp;ueb serveri &euml;sht&euml;&nbsp;nj&euml; softuer&nbsp;q&euml; i p&euml;rgjigjet k&euml;rkes&euml;s p&euml;r burime t&euml; uebit.</p>
            </div>
            <h3>Puna e ueb serverit</h3>
            <p>Ueb serveri i p&euml;rgjigjet k&euml;rkes&euml;s s&euml; klientit n&euml; nj&euml;r&euml;n nga dy m&euml;nyrat e m&euml;poshtme:</p>
            <ul>
                <li>D&euml;rgimi i fajllit tek klienti t&euml; shoq&euml;ruar nga URL-ja e k&euml;rkuar.</li>
                <li>Gjenerimi i p&euml;rgjigjes duke thirrur nj&euml; skript&euml; dhe duke komunikuar me baz&euml;n e t&euml; dh&euml;nave.</li>
            </ul>
            <div class="img-kodi elementet-html" style="text-align: center;">
                <img src="foto/ueb-serveri.jpg" alt="Ueb Serveri">
            </div>
            <p><strong>Pikat kryesore</strong></p>
            <ul>
                <li>Kur klienti d&euml;rgon k&euml;rkes&euml; p&euml;r nj&euml; ueb faqe, ueb serveri k&euml;rkon p&euml;r faqen e k&euml;rkuar, n&euml;se gjendet faqja e k&euml;rkuar, at&euml;her&euml; ai do t'ia d&euml;rgoj&euml; at&euml; klientit me nj&euml; p&euml;rgjigje HTT</li>
                <li>N&euml;se ueb faqja e k&euml;rkuar nuk gjendet, ueb serveri do t&euml; d&euml;rgoj&euml; nj&euml; <strong>HTTP response: Error 404 Not found.</strong></li>
                <li>N&euml;se klienti ka k&euml;rkuar p&euml;r disa burime tjera, ueb serveri do t&euml; kontaktoj&euml; me ueb serverin e aplikacionit dhe baz&euml;n e t&euml; dh&euml;nave p&euml;r t&euml; krijuar p&euml;rgjigjen HTTP.</li>
            </ul>
            <p>Ueb server&euml;t kryesor&euml; q&euml; jan&euml; sot n&euml; dispozicion:</p>
            <ul>
                <li>Apache HTTP Server</li>
                <li>Internet Information Services (IIS)</li>
                <li>Sun Java System Web Server, etj.</li>
            </ul>
            <h2>Ueb shfletuesi</h2>
            <p>Ueb Shfletuesi (<em>Web Browser</em>) &euml;sht&euml; nj&euml; softuer aplikativ q&euml; na lejon t&euml; shohim dhe t&euml; eksplorojm&euml; informacione n&euml; ueb. Shfryt&euml;zuesi mund t&euml; k&euml;rkoj&euml; &ccedil;do ueb faqe duke futur vet&euml;m nj&euml; URL n&euml; shiritin e adresave.</p>
            <p>Ueb Shfletuesi mund t&euml; paraqes tekst, audio, video, animacion, etj. &Euml;sht&euml; p&euml;rgjegj&euml;si e ueb shfletuesit t&euml; interpretoj&euml; tekstin dhe komandat q&euml; p&euml;rmbahen n&euml; ueb faqe.</p>
            <p>M&euml; par&euml; ueb shfletuesit ishin t&euml; bazuar n&euml; tekst nd&euml;rsa tani n&euml; dit&euml;t e sotme ueb shfletuesit bazohen gjithashtu n&euml; grafik&euml; ose n&euml; z&euml;. M&euml; posht&euml; jan&euml; ueb shfletuesit m&euml; t&euml; zakonsh&euml;m t&euml; disponuesh&euml;m sot:</p>
            <table>
                <tr>
                <td>
                <p><strong>Shfletuesi</strong></p>
                </td>
                <td>
                <p><strong>Prodhuesi</strong></p>
                </td>
                </tr>
                <tr>
                <td>
                <p>Microsoft Edge</p>
                </td>
                <td>
                <p>Microsoft</p>
                </td>
                </tr>
                <tr>
                <td>
                <p>Google Chrome</p>
                </td>
                <td>
                <p>Google</p>
                </td>
                </tr>
                <tr>
                <td>
                <p>Mozilla Firefox</p>
                </td>
                <td>
                <p>Mozilla</p>
                </td>
                </tr>
                <tr>
                <td>
                <p>Opera</p>
                </td>
                <td>
                <p>Opera Software</p>
                </td>
                </tr>
                <tr>
                <td>
                <p>Safari</p>
                </td>
                <td>
                <p>Apple</p>
                </td>
                </tr>
            </table>
            <h3>Arkitektura</h3>
            <p>Ka shum&euml; ueb shfletues t&euml; disponuesh&euml;m n&euml; treg. T&euml; gjith&euml; ata interpretojn&euml; dhe shfaqin informacione n&euml; ekran, megjithat&euml; aft&euml;sit&euml; dhe struktura e tyre ndryshojn&euml; n&euml; var&euml;si t&euml; implementimit. Por komponenta m&euml; themelore q&euml; t&euml; gjith&euml; ueb shfletuesit duhet t&euml; shfaqin jan&euml; radhitur m&euml; posht&euml;:</p>
            <ul>
                <li>Kontrolleri/ Dispe&ccedil;eri</li>
                <li>Interpretuesi</li>
                <li>Programet e Klientit</li>
            </ul>
            <p><strong>Kontrolleri</strong> punon si nj&euml;si kontrolli n&euml; CPU. Ai merr inputet (hyrjet) nga tastiera ose miu, i interpreton ato dhe b&euml;n q&euml; sh&euml;rbime t&euml; tjera t&euml; funksionojn&euml; n&euml; baz&euml; t&euml; inputit q&euml; merr.</p>
            <p><strong>Interpretuesi</strong> pranon informacionin nga kontrolleri dhe ekzekuton udh&euml;zimet rresht p&euml;r rresht. Disa interpretues jan&euml; t&euml; detyruesh&euml;m nd&euml;rsa disa jan&euml; opsional. P&euml;r shembull, interpretuesi i programit HTML &euml;sht&euml; i detyruesh&euml;m dhe interpretuesi java &euml;sht&euml; opsional.</p>
            <p><strong>Programi i Klientit</strong> p&euml;rshkruan protokollin specifik q&euml; do t&euml; p&euml;rdoret p&euml;r tu qas&euml; n&euml; nj&euml; sh&euml;rbim t&euml; ve&ccedil;ant&euml;. N&euml; vijim jan&euml; programet e klientit q&euml; p&euml;rdoren zakonisht:</p>
            <ul>
                <li>HTTP</li>
                <li>SMTP</li>
                <li>FTP, etj.</li>
            </ul>
            <div class="img-kodi elementet-html" style="text-align: center;">
                <img src="foto/klienti.jpg" alt="Klienti">
            </div>
            <h2>Ueb faqja</h2>
            <p><strong>Ueb faqja</strong> &euml;sht&euml; nj&euml; dokument i disponuesh&euml;m n&euml; rrjetin bot&euml;ror (<em>world wide web</em> &ndash; <em>www</em>). Ueb faqet ruhen n&euml; ueb server dhe mund t&euml; shikohen duke p&euml;rdorur nj&euml; ueb shfletues.</p>
            <p>Nj&euml; ueb faqe mund t&euml; p&euml;rmbaj&euml; shum&euml; informacione duke p&euml;rfshir&euml; tekst, grafik&euml;, audio, video dhe hiperlidhje. K&euml;to hiperlidhje jan&euml; lidhje me ueb faqet tjera.</p>
            <p>Koleksioni i ueb faqeve t&euml; lidhura n&euml; nj&euml; ueb server njihet si <strong>uebsajt</strong>. Ekziston nj&euml; Lokator Unik i Burimeve Uniform&euml; (<em>Uniform Resourse Locator &ndash; URL</em>) q&euml; shoq&euml;rohet me secil&euml;n ueb faqe.&nbsp;&nbsp;&nbsp;</p>
            <h3>Ueb faqet statike</h3>
            <p><strong>Ueb Faqet Statike</strong> njihen gjithashtu si faqe t&euml; sheshta ose stacionare. Ato lexohen n&euml; shfletuesin e klientit ashtu si&ccedil; jan&euml; t&euml; ruajtura sakt&euml;sisht n&euml; ueb serverin. Ueb faqe t&euml; tilla p&euml;rmbajn&euml; vet&euml;m informacione statike. Shfryt&euml;zuesi mundet vet&euml;m t&euml; lexoj&euml; informacionin por nuk mund t&euml; b&euml;j&euml; ndonj&euml; modifikim ose t&euml; nd&euml;rveproj&euml; me informacionin.</p>
            <p>Ueb faqet statike krijohen duke p&euml;rdorur vet&euml;m HTML. Ueb Faqet statike p&euml;rdoren vet&euml;m at&euml;her&euml; kur informacioni nuk k&euml;rkohet m&euml; p&euml;r t'u ndryshuar.</p>
            <div class="img-kodi elementet-html" style="text-align: center;">
                <img src="foto/ueb-faqja-statike.jpg" alt="Ueb faqja statike">
            </div>
            <h2>Ueb faqe dinamike</h2>
            <p><strong>Ueb faqja dinamike</strong> tregon informacione t&euml; ndryshme n&euml; momente t&euml; ndryshme kohore. &Euml;sht&euml; e mundur t&euml; ndryshoni nj&euml; pjes&euml; t&euml; nj&euml; ueb faqe pa e ngarkuar p&euml;rs&euml;ri t&euml;r&euml; ueb faqen. Kjo b&euml;het e mundur duke p&euml;rdorur teknologjin&euml; <strong>Ajax</strong>.</p>
            <h3>Ueb faqe dinamike nga ana e serverit</h3>
            <p>Krijohet duke p&euml;rdorur skriptingun nga ana e serverit. Ekzistojn&euml; parametra t&euml; skriptimit nga ana e serverit q&euml; p&euml;rcaktojn&euml; se si t&euml; nd&euml;rtoni nj&euml; ueb faqe t&euml; re, e cila gjithashtu p&euml;rfshin vendosjen e m&euml; shum&euml; procesimeve nga ana e klientit.</p>
            <h3>Ueb faqe dinamike nga ana e klientit</h3>
            <p>K&euml;to faqe krijohen duke p&euml;rdorur skriptimin nga ana e klientit si&ccedil; &euml;sht&euml; <strong>JavaScript</strong>, dhe pastaj p&euml;rcillen n&euml; Modelin e Objektit t&euml; Dokumentit (<strong><em>Document Object Model &ndash; DOM</em></strong>).</p>
            <div class="img-kodi elementet-html" style="text-align: center;">
                <img src="foto/ueb-faqja-dinamike.jpg" alt="Ueb faqja dinamike">
            </div>

        </section>

        <section id="gjuhet-skriptuese">
            <h1>Gjuh&euml;t Skriptuese</h1>
            <p>Nj&euml; gjuh&euml; skriptimi &euml;sht&euml; gjuh&euml; programimi q&euml; interpretohet, q&euml; do t&euml; thot&euml; se p&euml;rkthehet n&euml; kodin e makin&euml;s kur ekzekutohet kodi.&nbsp;Gjuh&euml;t e skriptimit p&euml;rdoren shpesh p&euml;r skripte t&euml; shkurtra n&euml; vend t&euml; programeve t&euml; plota kompjuterike.&nbsp;PHP, Perl dhe Python jan&euml; shembuj t&euml; zakonsh&euml;m t&euml; gjuh&euml;ve skriptuese.</p>
            <p>Gjuh&euml; skriptimi (e njohur gjithashtu si skripting, ose skript&euml;) p&euml;rcaktohet qart&euml; si nj&euml;&nbsp;seri urdhrash q&euml; jan&euml; n&euml; gjendje t&euml; ekzekutohen pa pasur nevoj&euml; p&euml;r kompajlim&nbsp;.&nbsp;Derisa t&euml; gjitha gjuh&euml;t e skriptimit jan&euml; gjuh&euml; programimi, jo t&euml; gjitha gjuh&euml;t e programimit jan&euml; gjuh&euml; skriptimi.&nbsp;&nbsp;</p>
            <p>Gjuh&euml;t e skriptimit p&euml;rdorin nj&euml; program t&euml; njohur si interpretues &ndash; p&euml;rkthyes&nbsp;p&euml;r t&euml; p&euml;rkthyer urdhrat dhe q&euml; interpretohen drejtp&euml;rdrejt nga kodi burimor, duke mos k&euml;rkuar nj&euml;&nbsp;hap&nbsp;kompjalimi&nbsp;.&nbsp;Nga ana tjet&euml;r, gjuh&euml;t e tjera t&euml; programimit, mund t&euml; k&euml;rkojn&euml; q&euml; nj&euml;&nbsp;<em>kompajler&nbsp;</em>t&euml; p&euml;rkthej&euml; urdhrat n&euml; kodin e makin&euml;s para se t&euml; ekzekutoj&euml; ato urdhra.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>
            <p>Nj&euml; gjuh&euml; e interpretuar e programimit &euml;sht&euml; nj&euml; gjuh&euml; e krijuar p&euml;r t&euml; ekzekutuar kodin burimor direkt dhe pa nevoj&euml;n e kompajlimit t&euml; nj&euml; programi n&euml; instruksionet e gjuh&euml;n s&euml; makin&euml;s.&nbsp;Nj&euml; interpretues do t&euml; ekzekutoj&euml; programin duke p&euml;rkthyer deklaratat (<em>statements</em>) n&euml; nj&euml; seri prej nj&euml; ose m&euml; shum&euml; n&euml;nrutinave p&euml;rpara se t'i p&euml;rkthej&euml; ato p&euml;rfundimisht n&euml; nj&euml; gjuh&euml; tjet&euml;r, si&ccedil; &euml;sht&euml; kodi i makin&euml;s.</p>
            <p>N&euml; gjuh&euml;t programuese t&euml; kompajluara, nj&euml; program kompajlues p&euml;rkthen kodin e shkruar prej nj&euml; gjuhe programimi t&euml; nivelit t&euml; lart&euml; n&euml; nj&euml; gjuh&euml; t&euml; nivelit m&euml; t&euml; ul&euml;t n&euml; m&euml;nyr&euml; q&euml; programi t&euml; ekzekutohet.&nbsp;Programet C ose Java zakonisht duhet t&euml; kompajlohen s&euml; pari n&euml; m&euml;nyr&euml; q&euml; t&euml; ekzekutohen.&nbsp;Dy kompajler t&euml; njohur jan&euml;&nbsp;<em>Eclipse</em>&nbsp;p&euml;r Java dhe&nbsp;<em>gcc</em>&nbsp;p&euml;r C dhe C++.</p>
            <h2>Skriptimi nga ana e serverit krahas skriptimit nga ana e klientit</h2>
            <p>Ekzistojn&euml; dy lloje t&euml; gjuh&euml;ve t&euml; skriptimit: nga ana e serverit dhe nga ana e klientit.&nbsp;I vetmi ndryshim i r&euml;nd&euml;sish&euml;m midis t&euml; dyve &euml;sht&euml; se i pari k&euml;rkon nj&euml; server p&euml;r ta proceduar.&nbsp;</p>
            <p>Gjuh&euml;t e skriptimit nga ana e serverit ekzekutohen n&euml; nj&euml; ueb server.&nbsp;Kur nj&euml; klient d&euml;rgon nj&euml; k&euml;rkes&euml;, serveri p&euml;rgjigjet duke i d&euml;rguar p&euml;rmbajtjen p&euml;rmes HTTP.&nbsp;N&euml; t&euml; kund&euml;rt, gjuh&euml;t e skriptimit nga ana e klientit ekzekutohen n&euml; an&euml;n e klientit - n&euml; shfletuesin e tyre t&euml; internetit.</p>
            <p>P&euml;rfitimi i skripteve nga ana e klientit &euml;sht&euml; se ato mund t&euml; reduktojn&euml; k&euml;rkesat n&euml; server, duke lejuar q&euml; ueb faqet t&euml; lexohen m&euml; shpejt.&nbsp;Nd&euml;rsa, nj&euml; p&euml;rfitim i r&euml;nd&euml;sish&euml;m i skripteve nga ana e serverit &euml;sht&euml; se ato nuk jan&euml; t&euml; dukshme nga publiku si&ccedil; jan&euml; skriptet nga ana e klientit.</p>
            <p>Kur vendosni se n&euml; cil&euml;n m&euml;nyr&euml; t&rsquo;ju qaseni nj&euml; projekti, mbani n&euml; mend se skriptimi nga ana e klientit &euml;sht&euml; m&euml; i fokusuar n&euml; nd&euml;rfaqen e p&euml;rdoruesit (<em>user interface</em>) dhe funksionalitet.&nbsp;N&euml; t&euml; kund&euml;rt, skriptimi nga ana e serverit fokusohet n&euml; procedim m&euml; t&euml; shpejt&euml;, qasje n&euml; t&euml; dh&euml;na dhe zgjidhjen e gabimeve.</p>
            <h3>Shembuj t&euml;&nbsp;gjuh&euml;ve t&euml;&nbsp;skriptimit nga&nbsp;ana e serverit</h3>
            <p>M&euml; posht&euml; jan&euml; dh&euml;n&euml; shembuj t&euml; gjuh&euml;ve t&euml; skriptimit nga ana e serverit.&nbsp;</p>

            <table>
            <tr>
            <td>
            <p><strong>Gjuh&euml;</strong></p>
            </td>
            <td>
            <p><strong>Komente</strong></p>
            </td>
            </tr>
            <tr>
            <td>
            <p>PHP</p>
            </td>
            <td>
            <p>Gjuha m&euml; e njohur nga ana e serverit q&euml; p&euml;rdoret n&euml; ueb.</p>
            </td>
            </tr>
            <tr>
            <td>
            <p>ASP.NET</p>
            </td>
            <td>
            <p>Biblioteka (framework) e ueb aplikacioneve e zhvilluar nga Microsoft.</p>
            </td>
            </tr>
            <tr>
            <td>
            <p>Node.js</p>
            </td>
            <td>
            <p>Mund t&euml; ekzekutohet n&euml; nj&euml; mori platformash, p&euml;rfshir&euml; Windows, Linux, Unix, Mac, etj.</p>
            </td>
            </tr>
            <tr>
            <td>
            <p>Java</p>
            </td>
            <td>
            <p>P&euml;rdoret n&euml; gjith&ccedil;ka, nga Bluetooth stereoja e makin&euml;s suaj deri tek aplikacionet e NASA-s.</p>
            </td>
            </tr>
            <tr>
            <td>
            <p>Ruby</p>
            </td>
            <td>
            <p>Dinamik.&nbsp;P&euml;rqendrohet shum&euml; tek thjesht&euml;sia.</p>
            </td>
            </tr>
            <tr>
            <td>
            <p>Perl</p>
            </td>
            <td>
            <p>Nj&euml; grim&euml;&nbsp;kombinimi&nbsp;midis C, skriptave shell, AWK dhe sed.</p>
            </td>
            </tr>
            <tr>
            <td>
            <p>Python</p>
            </td>
            <td>
            <p>E shk&euml;lqyeshme p&euml;r fillestar&euml;t p&euml;r t&euml; m&euml;suar.&nbsp;P&euml;rdor kodin m&euml; t&euml; shkurt&euml;r.</p>
            </td>
            </tr>
            </table>
            <h3>Shembuj t&euml; gjuh&euml;ve t&euml; skriptimit nga ana e klientit</h3>
            <p>M&euml; posht&euml; jan&euml; shembuj t&euml; gjuh&euml;ve skriptuese nga ana e klientit.</p>

            <table>
            <tr>
            <td>
            <p><strong>Gjuh&euml;</strong></p>
            </td>
            <td>
            <p><strong>Komente</strong></p>
            </td>
            </tr>
            <tr>
            <td>
            <p>HTML</p>
            </td>
            <td>
            <p>Themeli i zhvillimit t&euml; ueb-it.</p>
            </td>
            </tr>
            <tr>
            <td>
            <p>CSS</p>
            </td>
            <td>
            <p>P&euml;rmir&euml;son pamjen dhe grafikun n&euml; faqet e&nbsp; ueb shfletuesin tuaj.</p>
            </td>
            </tr>
            <tr>
            <td>
            <p><strong>JavaScript</strong></p>
            </td>
            <td>
            <p>Megjith&euml;se tipik nga&nbsp;ana e&nbsp;klientit,&nbsp;her&euml; pas here mund t&euml; p&euml;rdoret edhe nga ana e serverit.</p>
            </td>
            </tr>
            </table>
        </section>

        <section id="hyrje-ne-javascript">
            <h1>Hyrje n&euml;&nbsp;JavaScript</h1>
            <p>N&euml; k&euml;t&euml; material m&euml;simor do t&euml; m&euml;soni se si t&euml; krijoni nj&euml; ueb-faqe me JavaScript.</p>
            <p>K&euml;tu, ju do t&euml; m&euml;soni se sa e leht&euml; &euml;sht&euml; t&euml; shtoni nd&euml;rveprimin (ineraktivitet) n&euml; nj&euml; ueb-faqe duke p&euml;rdorur JavaScript. Por, para k&euml;saj, duhet q&euml; t&euml; keni disa njohuri pune n&euml; HTML dhe CSS.</p>
            <h2>Shtimi i JavaScript n&euml; faqet tuaja t&euml; uebit</h2>
            <p>Zakonisht ekzistojn&euml; tri m&euml;nyra p&euml;r t&euml; shtuar JavaScript-in n&euml; nj&euml; ueb-faqe:</p>
            <ul>
            <li>Vendosja e kodit JavaScript brenda n&euml; HTML n&euml; mes etiketave <code>&lt;script&gt;</code> dhe <code>&lt;/script&gt;</code>.</li>
            <li>Krijimi i nj&euml; fajlli t&euml; jasht&euml;m JavaScript me ekstensionin .<strong>js</strong> dhe m&euml; pas t&euml; krijohet nj&euml; lidhje p&euml;rmes atributit <strong><code>src</code></strong> nga etiketa <code>&lt;script&gt;</code>.</li>
            <li>Vendosja e kodit JavaScript direkt brenda nj&euml; etikete HTML duke p&euml;rdorur atributet speciale t&euml; etiketave t&euml; tilla si <code>onclick, onmouseover, onkeypress, onload</code>, etj.</li>
            </ul>
            <h2>Vendosja e kodit JavaScript brenda n&euml; HTML</h2>
            <p>Ju mund ta vendosni kodin JavaScript direkt n&euml; ueb-faqet tuaja duke e vendosur at&euml; n&euml; mes etiketave <code>&lt;script&gt;</code> dhe <code>&lt;/script&gt;</code>. Etiketa <code>&lt;script&gt;</code> i tregon shfletuesit se udh&euml;zimet q&euml; p&euml;rmbahen duhet t&euml; t&euml; interpretohen si kod i ekzekutuesh&euml;m dhe jo HTML.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;!DOCTYPE html&gt;
&lt;html&gt;
&lt;head&gt;
&nbsp; &nbsp;&lt;meta charset="UTF-8"&gt;
&nbsp; &nbsp;&lt;title&gt;Vendosja e JavaScript-it&lt;/title&gt;
&lt;/head&gt;
&lt;body&gt;
&nbsp; &nbsp;&lt;script&gt;
&nbsp; &nbsp;var persh = "P&euml;rsh&euml;ndetje Bot&euml;!";
&nbsp; &nbsp;document.write(persh); // Sh&euml;nohet: P&euml;rsh&euml;ndetje Bot&euml;!
&nbsp; &nbsp;&lt;/script&gt;
&lt;/body&gt;
&lt;/html&gt;</code></pre>
                </div>
            </div>
            <p>Kodi JavaScript n&euml; shembullin e m&euml;sip&euml;rm thjesht shtyp nj&euml; mesazh me tekst n&euml; ueb-faqe.</p>
            <h2>Thirrja e nj&euml; fajlli t&euml; jasht&euml;m JavaScript</h2>
            <p>Ju gjithashtu mund ta vendosni kodin tuaj JavaScript n&euml; nj&euml; fajll t&euml; ve&ccedil;ant&euml; me ekstensionin <strong>.<em>js</em></strong>, dhe pastaj thirrni at&euml; fajll n&euml; dokumentin tuaj p&euml;rmes atributit <code><strong>src</strong></code> t&euml; etiket&euml;s <code>&lt;script&gt;</code>, k&euml;sisoj:</p>    
            <div class="sintaksa">
<pre><code>&lt;script src="js/main.js"&gt;&lt;/script&gt;</code></pre>
            </div>
            <p>Kjo &euml;sht&euml; e dobishme n&euml;se doni t&euml; nj&euml;jtin kod JavaScript t&euml; disponuesh&euml;m ta shfryt&euml;zoni p&euml;r shum&euml; dokumente. Kjo ju kursen nga p&euml;rs&euml;ritja e s&euml; nj&euml;jt&euml;s detyr&euml; n&euml; secil&euml;n ueb-faqe, dhe e b&euml;n ueb-sajtin tuaj shum&euml; t&euml; leht&euml; p&euml;r tu mir&euml;mbajtur.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>// Nj&euml; funksion q&euml; e shfaq&euml; mesazhin
function thuajTung() {
    alert("P&euml;rsh&euml;ndetje Bot&euml;!");
}
    
// Thirr funksionin duke klikuar n&euml; buton
document.getElementById("btn").onclick = thuajTung;</code></pre>
                </div>
            </div>
            <p>Tani, mund ta th&euml;rrisni k&euml;t&euml; fajll t&euml; jasht&euml;m JavaScript n&euml; ueb-faqe duke p&euml;rdorur etiket&euml;n <code>&lt;script&gt;</code>, k&euml;sisoj:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;!DOCTYPE html&gt;
&lt;html&gt;
&lt;head&gt;
    &lt;meta charset="UTF-8"&gt;
    &lt;title&gt;P&euml;rfshirja e fajllit t&euml; jasht&euml;m JavaScript&lt;/title&gt;
&lt;/head&gt;
&lt;body&gt;
    &lt;button type="button" id="btn"&gt;Kliko&lt;/button&gt;
    &lt;script src="js/main.js"&gt;&lt;/script&gt;
&lt;/body&gt;
&lt;/html&gt;</code></pre>
                </div>
	        </div>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Zakonisht kur nj&euml; fajll i jasht&euml;m JavaScript shkarkohet p&euml;r her&euml; t&euml; par&euml;, ai ruhet n&euml; memorien e shfletuesit (ashtu si imazhet dhe fajllat CSS), k&euml;shtu q&euml; nuk do t&euml; duhet t&euml; shkarkohet disa her&euml; nga ueb-serveri, k&euml;sisoj i b&euml;n ueb-faqet t&euml; lexohen m&euml; shpejt.</p>
            </div>
            <h2>Vendosja e kodit JavaScript n&euml; linj&euml; (<em>inline</em>)</h2>
            <p>Ju gjithashtu mund t&euml; vendosni kodin JavaScript brenda duke e futur at&euml; direkt brenda nj&euml; etikete HTML duke p&euml;rdorur atributet speciale t&euml; etiketave t&euml; tilla si<code> onclick<em>, </em>onmouseover<em>, </em>onkeypress<em>, </em>onload,</code> etj.</p>
            <p>Sidoqoft&euml;, duhet t&euml; evitoni vendosjen e sasis&euml; s&euml; madhe t&euml; kodit JavaScript inline, pasi rr&euml;mon HTML-n&euml; tuaj me JavaScript dhe e b&euml;n t&euml; v&euml;shtir&euml; mir&euml;mbajtjen e kodit tuaj JavaScript.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;!DOCTYPE html&gt;&lt;html&gt;
&lt;head&gt;
    &lt;meta charset="UTF-8"&gt;
    &lt;title&gt;JavaScript inline&lt;/title&gt;
&lt;/head&gt;
&lt;body&gt;
    &lt;button onclick="alert('P&euml;rsh&euml;ndetje Bot&euml;!')"&gt;Kliko&lt;/button&gt;
&lt;/body&gt;
&lt;/html&gt;</code></pre>
                </div>
	        </div>
            <p>Shembulli i m&euml;sip&euml;rm do t'ju tregoj&euml; mesazhin &ldquo;P&euml;rsh&euml;ndetje Bot&euml;!&rdquo; n&euml; nj&euml; dritare <em>pop-up</em> alarmuese n&euml;se klikojm&euml; n&euml; buton.</p>
            <div class="keshille">
                <p><strong>K&euml;shill&euml;:</strong> Mbani gjithmon&euml; p&euml;rmbajtjen dhe struktur&euml;n e ueb-faqes suaj (d.m.th. HTML-n&euml;) t&euml; ndar&euml; nga prezantimi (CSS) dhe sjellja (JavaScript).</p>
            </div>
            <h2>Pozicionimi i kodit JavaScript brenda dokumentit HTML</h2>
            <p>Elementi <code>&lt;script&gt;</code> mund t&euml; vendoset n&euml; seksionin <code>&lt;head&gt;</code>, ose <code>&lt;body&gt;</code> t&euml; nj&euml; dokumenti HTML. Por n&euml; m&euml;nyr&euml; ideale, skriptet duhet t&euml; vendosen n&euml; fund t&euml; seksionit t&euml; <em>body</em>-it, pak para etiket&euml;s mbyll&euml;se <code>&lt;/body&gt;</code>, kjo do t&euml; b&euml;j&euml; q&euml; ueb-faqet tuaja t&euml; lexohen m&euml; shpejt, pasi parandalohen pengesat e inicimit fillestar t&euml; faqes.</p>
            <p>Secila etiket&euml; <code>&lt;script&gt;</code> bllokon procesin e paraqitjes s&euml; faqes derisa t&euml; ket&euml; shkarkuar dhe ekzekutuar plot&euml;sisht kodin JavaScript, k&euml;shtu q&euml; vendosja e tyre n&euml; seksionin e kok&euml;s (d.m.th. brenda elementit <code>&lt;head&gt;</code>) pa ndonj&euml; arsye t&euml; vlefshme, do t&euml; ndikoj&euml; ndjesh&euml;m n&euml; performanc&euml;n e ueb-sajtit tuaj.</p>
            <div class="keshille">
                <p><strong>K&euml;shill&euml;:</strong> Mund t&euml; vendosni m&euml; shum&euml; se nj&euml; element <code>&lt;script&gt;</code> n&euml; nj&euml; dokument t&euml; vet&euml;m HTML. Sidoqoft&euml;, ato procesohen sipas radh&euml;s n&euml; t&euml; cil&euml;n shfaqen n&euml; dokument, nga lart posht&euml;.</p>
            </div>
            <h2>Diferenca n&euml; mes skriptimit nga ana e klientit dhe nga ana e serverit</h2>
            <p>Gjuh&euml;t e skriptimit nga ana e klientit (<em>client-side</em>) si <strong><em>JavaScript</em></strong>, <strong><em>VBScript</em></strong>, etj., interpretohen dhe ekzekutohen nga shfletuesi i internetit, nd&euml;rsa gjuh&euml;t e skriptimit n&euml; an&euml;n e serverit (<em>server-side</em>) si <strong><em>PHP</em></strong>, <strong><em>ASP</em></strong>, <strong><em>Java</em></strong>, <strong><em>Python</em></strong>, <strong><em>Ruby</em></strong>, etj., ekzekutohen n&euml; ueb-server dhe rezultatin e d&euml;rgojn&euml; tek shfletuesi - klienti n&euml; formatin HTML.</p>
            <p>Skriptimi nga ana e klientit ka shum&euml; p&euml;rpar&euml;si krahasuar me qasjen tradicionale t&euml; skriptimit nga ana e serverit. P&euml;r shembull, mund t&euml; p&euml;rdorni JavaScript p&euml;r t&euml; kontrolluar n&euml;se p&euml;rdoruesi ka futur t&euml; dh&euml;na t&euml; pavlefshme n&euml; fushat e form&euml;s dhe t&euml; tregoni njoftime p&euml;r gabime gjat&euml; futjes s&euml; t&euml; dh&euml;nave n&euml; p&euml;rputhje me rrethanat n&euml; koh&euml; reale para se t&rsquo;i dor&euml;zoni formularin me sh&euml;nime n&euml; ueb-serverin p&euml;r vler&euml;simin p&euml;rfundimtar t&euml; t&euml; dh&euml;nave dhe p&euml;rpunimin e m&euml;tejsh&euml;m, n&euml; m&euml;nyr&euml; q&euml; t&euml; parandaloni p&euml;rdorimet e panevojshme t&euml; brezit l&euml;shues t&euml; rrjetit dhe shfryt&euml;zimin e panevojsh&euml;m t&euml; resurseve t&euml; serverit.</p>
            <p>Gjithashtu, p&euml;rgjigja nga nj&euml; skript&euml; nga ana e serverit &euml;sht&euml; m&euml; e ngadalt&euml; n&euml; krahasim me nj&euml; skript&euml; nga ana e klientit, sepse skriptet nga ana e serverit procesohen n&euml; kompjuterin n&euml; larg&euml;si dhe jo n&euml; kompjuterin lokal t&euml; shfryt&euml;zuesit.</p>

        </section> 
        
        <section id="sintaksa">
            <h1>Sintaksa e JavaScript-it</h1>
            <p>Sintaksa e JavaScript-it &euml;sht&euml; t&euml;r&euml;sia e rregullave q&euml; p&euml;rcaktojn&euml; nj&euml; program JavaScript t&euml; strukturuar si&ccedil; duhet.</p>
            <p>Nj&euml; JavaScript konsiston prej udh&euml;zimeve (<em>statements</em>) t&euml; JavaScript-it q&euml; vendosen brenda etiketave HTML <code>&lt;script&gt; &lt;/script&gt;</code> n&euml; nj&euml; ueb-faqe, ose brenda fajllit t&euml; jasht&euml;m me ekstension .<strong>js</strong>.</p>
            <p>Shembulli i m&euml;posht&euml;m tregon se si duken udh&euml;zimet n&euml; JavaScript:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var x = 5;
var y = 10;
var shuma = x + y;
document.write(shuma); // Sh&euml;nohet vlera e variabl&euml;s</code></pre>
                </div>
	        </div>
            <h2>Ndjeshm&euml;ria e shkronjave n&euml; JavaScript (<em>Case Sensitivity</em>)</h2>
            <p>JavaScript &euml;sht&euml; i ndjesh&euml;m n&euml; var&euml;si a p&euml;rdoren shkronjat e m&euml;dha apo t&euml; vogla. Kjo do t&euml; thot&euml; q&euml; variablat, fjal&euml;t ky&ccedil;e t&euml; gjuh&euml;s, em&euml;rtimet e funksioneve dhe identifikuesit e tjer&euml; duhet t&euml; sh&euml;nohen gjithmon&euml; me shkronja t&euml; m&euml;dha apo t&euml; vogla dhe n&euml; m&euml;nyr&euml; t&euml; nj&euml;jt&euml; edhe t&euml; identifikohen m&euml; pas.</p>
            <p>P&euml;r shembull, variabla <code>myVar</code> duhet t&euml; sh&euml;nohet <code>myVar</code> jo <code>MyVar</code> ose <code>myvar</code>. N&euml; m&euml;nyr&euml; t&euml; ngjashme, emri i metod&euml;s <code>getElementById()</code> duhet t&euml; sh&euml;nohet sakt&euml;sisht, jo k&euml;sisoj <code>getElementByID()</code>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var myVar = "P&euml;rsh&euml;ndetje Bot&euml;!";
console.log(myVar);
console.log(MyVar);
console.log(myvar);</code></pre>
                </div>
	        </div> 
            <p>N&euml;se hapni konsol&euml;n e shfletuesit duke shtypur tastin f12 n&euml; tastier&euml;, do t&euml; shihni nj&euml; rresht&nbsp; k&euml;sisoj: "<code>Uncaught ReferenceError: MyVar is not defined</code>".</p>
            <h2>Komentet n&euml; JavaScript</h2>
            <p>Nj&euml; koment &euml;sht&euml; thjesht nj&euml; linj&euml; teksti q&euml; injorohet plot&euml;sisht nga interpretuesi JavaScript. Komentet zakonisht shtohen me q&euml;llim t&euml; sigurimit t&euml; informacionit shtes&euml; q&euml; ka t&euml; b&euml;j&euml; me kodin burimor. Kjo jo vet&euml;m q&euml; do t'ju ndihmoj&euml; t&euml; kuptoni kodin tuaj kur kujdeseni pas nj&euml; periudh&euml; kohore por edhe t&euml; tjer&euml;t q&euml; punojn&euml; me ju n&euml; t&euml; nj&euml;jtin projekt.</p>
            <p>JavaScript mb&euml;shtet komente me nj&euml; rresht si dhe me shum&euml; rreshta. Komentet n&euml; nj&euml; rresht fillojn&euml; me dy viza t&euml; pjerr&euml;ta p&euml;rpara (<code>//</code>), e ndjekur nga teksti i komentit.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>// Ky &euml;sht&euml; programi im i par&euml; n&euml; JavaScript
document.write("P&euml;rsh&euml;ndetje Bot&euml;!");</code></pre>
                </div>
	        </div> 
            <p>Nd&euml;rsa, nj&euml; koment n&euml; disa rreshta fillon me nj&euml; viz&euml; t&euml; pjerrt&euml; dhe nj&euml; yll (<code>/*</code>) dhe p&euml;rfundon me nj&euml; yll dhe nj&euml; viz&euml; t&euml; pjerrt&euml; (<code>*/</code>).</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>/* Ky &euml;sht&euml; programi im i par&euml;
n&euml; JavaScript */
document.write("P&euml;rsh&euml;ndetje Bot&euml;!");</code></pre>
                </div>
	        </div> 

        </section>

        <section id="variablat">
            <h1>Variablat</h1>
            <p>Variablat jan&euml; thelb&euml;sore p&euml;r t&euml; gjitha gjuh&euml;t programuese. Variablat p&euml;rdoren p&euml;r t&euml; ruajtur t&euml; dh&euml;nat, si tekste, numra, etj. T&euml; dh&euml;nat ose vlera e ruajtur n&euml; variabla mund t&euml; vendosen, p&euml;rdit&euml;sohet dhe t&euml; lexohet sa her&euml; q&euml; t&euml; jet&euml; e nevojshme. N&euml; p&euml;rgjith&euml;si, variablat jan&euml; emra simbolik&euml; p&euml;r vlerat.</p>
            <p>Mund t&euml; krijojm&euml; nj&euml; variab&euml;l me fjal&euml;n ky&ccedil;e var, nd&euml;rsa operatori i barazimit (=) p&euml;rdoret p&euml;r t'i caktuar vler&euml; nj&euml; variable, si kjo:<code> var varEmri = vlera;</code></p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var emri = "Filan Fisteku";
var mosha = 17;
var eshteMartuar = false;</code></pre>
                </div>
	        </div>
            <div class="keshille">
                <p><strong>K&euml;shill&euml;</strong>: Gjithmon&euml; jepni emra kuptimplot&euml; variablave tuaja. P&euml;r m&euml; tep&euml;r, p&euml;r em&euml;rtimin e variablave q&euml; p&euml;rmbajn&euml; shum&euml; fjal&euml;, zakonisht p&euml;rdoret e ashtuquajtura metoda <em>camelCase</em>. N&euml; k&euml;t&euml; konvent&euml; e gjith&euml; fjalia pas s&euml; par&euml;s duhet t&euml; ket&euml; shkronjat e para t&euml; m&euml;dha, p.sh. <code>emriGjateVariables</code>.</p>
            </div>
            <p>N&euml; shembullin e m&euml;sip&euml;rm kemi krijuar tri variabla, t&euml; par&euml;s ju &euml;sht&euml; caktuar nj&euml; vler&euml; string (tekst), t&euml; dyt&euml;s ju &euml;sht&euml; caktuar nj&euml; num&euml;r, nd&euml;rsa t&euml; fundit ju &euml;sht&euml; caktuar nj&euml; vler&euml; <em>boolean</em>. Pra, konsiderojm&euml; se variablat mund t&euml; p&euml;rmbajn&euml; tipe t&euml; ndryshme t&euml; t&euml; dh&euml;nave.</p>
            <p>N&euml; JavaScript, variablat mund t&euml; deklarohen gjithashtu pa ju caktuar ndonj&euml; vler&euml; fillestare. Kjo &euml;sht&euml; e dobishme p&euml;r variablat q&euml; supozohet t&euml; marrin vlera nga futja e t&euml; dh&euml;nave t&euml; shfryt&euml;zuesve (<em>inputs</em>).</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>// Deklarimi i varibl&euml;s
var emriPerdoruesit;
    
// Caktimi i vler&euml;s
emriPerdoruesit = "Filan Fisteku";</code></pre>
                </div>
	        </div> 
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: N&euml; JavaScript, n&euml;se nj&euml; variab&euml;l &euml;sht&euml; deklaruar, por nuk i &euml;sht&euml; caktuar nj&euml; vler&euml; e qart&euml; (eksplicite), n&euml; m&euml;nyr&euml; automatike ju caktohet vlera <code>undefined</code>.</p>
            </div>
            <h2>Deklarimi i variablave t&euml; shum&euml;fishta p&euml;rnj&euml;her&euml;</h2>
            <p>P&euml;rve&ccedil; deklarimit t&euml; variablave nj&euml; nga nj&euml;, ju gjithashtu mund t&euml; deklaroni shum&euml; variabla dhe t&euml; vendosni vlerat e tyre fillestare n&euml; nj&euml; urdh&euml;res&euml; t&euml; vetme. &Ccedil;do variab&euml;l ndahet me presje, si&ccedil; demonstrohet n&euml; shembullin vijues:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>// Deklarimi i variablave t&euml; shum&euml;fishta
var emri = "Filan Fisteku", mosha = 17, eshteMartuar = false;
    
/* Deklarimi i gjat&euml; mund t&euml; ndahet n&euml; disa
rreshta p&euml;r t&euml; p&euml;rmir&euml;suar lexueshm&euml;rin&euml; */
var emri = "Filan Fisteku",
mosha = 17,
eshteMartuar = false;</code></pre>
                </div>
	        </div> 
            <h2>Fjal&euml;t ky&ccedil;e <em>let</em> dhe <em>const</em> <mark>ES6</mark></h2>
            <p>ES6 ofron dy fjal&euml; ky&ccedil;e t&euml; reja <code>let</code> dhe <code>const</code> p&euml;r deklarimin e variablave.</p>
            <p>Fjala ky&ccedil;e <code>const</code> sh&euml;rben sakt&euml;sisht nj&euml;soj si <code>let</code>, p&euml;rve&ccedil; q&euml; variablave t&euml; deklaruara duke p&euml;rdorur fjal&euml;n ky&ccedil;e <code>const</code> nuk mund t&euml; ju ricaktohet vlera m&euml; von&euml; n&euml; kod.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>// Deklarimi i variablave
let emri = "Filan Fisteku";
let mosha = 17;
let eshteNxenes = true;
    
// Deklarimi i konstantës
const PI = 3.14;
console.log(PI); // 3.14
    
// Tentim për t’ju ricaktu vlera
PI = 10; // gabim</code></pre>
                </div>
            </div>
            <p>Ndryshe nga <code>var</code>, q&euml; deklaron variablat e p&euml;rcaktuar brenda funksionit (<em>function-scoped variables</em>), t&euml; dy fjal&euml;t ky&ccedil;e <code>let</code> dhe <code>const</code> deklarojn&euml; variabla, t&euml; p&euml;rcaktuara brenda bllokut ({ }). Fush&euml;veprimi i bllokut do t&euml; thot&euml; q&euml; krijohet nj&euml; fush&euml; e re midis nj&euml; pal&euml; kllapave t&euml; m&euml;dha { }.</p>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Fjal&euml;t ky&ccedil;e <code>let</code> dhe <code>const</code> nuk mb&euml;shteten nga shfletuesit e vjet&euml;r si p.sh. IE10.</p>
            </div>
            <h2>Konventat p&euml;r em&euml;rtimet e variablave n&euml; JavaScript</h2>
            <p>K&euml;to jan&euml; rregullat p&euml;r em&euml;rtimin e nj&euml; variable n&euml; JavaScript:</p>
            <ul>
                <li>Emri i variabl&euml;s duhet t&euml; filloj&euml; me nj&euml; shkronj&euml;, n&euml;nvizim (_), ose me shenj&euml; dollari ($).</li>
                <li>Emri i variabl&euml;s nuk mund t&euml; filloj&euml; me nj&euml; num&euml;r.</li>
                <li>Emri i variabl&euml;s mund t&euml; p&euml;rmbaj&euml; vet&euml;m karaktere alfa-numerike (A-z, 0-9) dhe n&euml;nvizime.</li>
                <li>Emri i variabl&euml;s nuk mund t&euml; p&euml;rmbaj&euml; hap&euml;sira.</li>
                <li>Emri i variabl&euml;s nuk mund t&euml; jet&euml; nj&euml; fjal&euml; ky&ccedil;e q&euml; i p&euml;rkasin JavaScript-it ose nj&euml; fjal&euml; e rezervuar JavaScript.</li>
            </ul>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Emrat e variablave n&euml; JavaScript jan&euml; t&euml; ndjesh&euml;m n&euml; var&euml;si nga shkronjat e m&euml;dha dhe t&euml; vogla (<em>case sensitive</em>), do t&euml; thot&euml; q&euml; <code>$myvar</code> dhe <code>$myVar</code> jan&euml; dy variabla t&euml; ndryshme. K&euml;shtu q&euml; keni kujdes gjat&euml; em&euml;rimit t&euml; variablave.</p>
            </div>
        
        </section>
        
        <section id="gjenerimi-i-rezultateve">
            <h1>Gjenerimi i rezultateve</h1>
            <p>N&euml; cilin do rast kur sh&euml;noni kodin JavaScript, juve ju nevojitet t&euml; gjeneroni rezultate nga kodi juaj. P&euml;r shembull, ju mund t&euml; d&euml;shironi t&euml; shihni vler&euml;n e variabl&euml;s, ose t&euml; shkruani nj&euml; mesazh n&euml; konzol&euml;n e shfletuesit p&euml;r t'ju ndihmuar t&euml; korrigjoni nj&euml; problem n&euml; kodin tuaj JavaScript, etj.</p>
            <p>N&euml; JavaScript ka disa m&euml;nyra t&euml; ndryshme p&euml;r t&euml; gjeneruar rezultatet, p&euml;rfshir&euml; rezultatet dal&euml;se n&euml; dritaren e shfletuesit ose konsol&euml;n e shfletuesit, paraqitjen e rezultateve n&euml; dialog-dritare (pop-up), si dhe n&euml; ndonj&euml; element HTML.</p>
            <h2>Rezultatet n&euml; konzol&euml;n e shfletuesit</h2>
            <p>Shum&euml; leht&euml; mund t&euml; nxirrni nj&euml; mesazh ose t&euml; shkruani t&euml; dh&euml;na n&euml; konzol&euml;n e shfletuesit duke p&euml;rdorur metod&euml;n <code>console.log()</code>. Kjo &euml;sht&euml; nj&euml; metod&euml; e thjesht&euml;, por shum&euml; e fuqishme p&euml;r gjenerimin e rezultateve t&euml; detajuara.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>// Shënimi i një tekst mesazhi të thjeshtë
console.log("Përshëndetje Botë!"); // Shënohet: Përshëndetje Botë!
    
// Vlerat e variablave 
var x = 10;
var y = 20;
var shuma = x + y;
console.log(shuma); // Shënohet: 30</code></pre>
                </div>
	        </div>         
            <div class="keshille">
                <p><strong>K&euml;shill&euml;</strong>: P&euml;r ta hapur konzol&euml;n e shfletuesit tuaj, shtypni tastin <strong>F12</strong> n&euml; tastier&euml; apo klikoni nga dritarja e ueb-faqes me butonin e djatht&euml; t&euml; mausit, klikoni <strong>Inspect</strong>, e m&euml; pas nga menyja e dritares s&euml; hapur zgjidhni <strong>Console</strong>.</p>
            </div>
            <h2>Paraqitja e rezultateve n&euml; dritare <em>Pop-Up</em></h2>
            <p>Gjithashtu mund t&euml; p&euml;rdorni dialog-dritaren <em>alert</em> apo si njihet ndryshe dritare pop-up p&euml;r t&euml; paraqitur mesazhe apo t&euml; dh&euml;na tjera p&euml;r shfryt&euml;zuesit. Nj&euml; dritare e till&euml; krijohet duke p&euml;rdor metod&euml;n <code>alert()</code>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>// Shfaqja e një tekst mesazhi të thjeshtë
alert("Përshëndetje Botë!"); // Rezultati: Përshëndetje Botë!
    
// Shfaqja e vlerës së variablës 
var x = 10;
var y = 20;
var shuma = x + y;
alert(shuma); // Rezultati: 30</code></pre>
                </div>
	        </div> 
            <h2>Paraqitja e rezultateve n&euml; dritaren e shfletuesit</h2>
            <p>Metoda <code>document.write()</code> p&euml;rdoret p&euml;r tu paraqitur p&euml;rmbajtja n&euml; dokumentin aktual vet&euml;m derisa ai dokument t&euml; analizohet.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>// Shtypja e një tekst mesazhi të thjeshtë
document.write("Përshëndetje Botë!"); // Shtypet: Përshëndetje Botë!
    
// Shtypja e vlerave të variablave 
var x = 10;
var y = 20;
var shuma = x + y;
document.write(shuma); // Shtypet: 30</code></pre>
                </div>
	        </div> 
            <p>N&euml;se p&euml;rdorni metod&euml;n <code>document.write()</code> pasi faqja t&euml; jet&euml; ngarkuar, ajo do t&euml; mbishkruaj t&euml; gjith&euml; p&euml;rmbajtjen ekzistuese n&euml; at&euml; dokument.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;h1&gt;Ky &euml;sht&euml; nj&euml; titull&lt;/h1&gt;
&lt;p&gt;Ky &euml;sht&euml; nj&euml; paragraph me tekst.&lt;/p&gt;
    
&lt;button type="button" onclick="document.write('P&euml;rsh&euml;ndetje Bot&euml;!')"&gt;Kliko&lt;/button&gt;</code></pre>
                </div>
	        </div> 
            <h2>Vendosja e rezultatit brenda nj&euml; elementi HTML</h2>
            <p>Gjithashtu mund t&euml; shkruani ose futni rezultate brenda nj&euml; elementi HTML duke p&euml;rdor vetin&euml; (<em>property</em>) <code>innerHTML</code>. Sidoqoft&euml;, para se t&euml; shkruajm&euml; daljen, s&euml; pari duhet t&euml; zgjedhim elementin duke p&euml;rdorur nj&euml; metod&euml; t&euml; till&euml; si <code>getElementById()</code>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;p id="persh"&gt;&lt;/p&gt;
&lt;p id="rezul"&gt;&lt;/p&gt;
    
&lt;script&gt;
    // Sh&euml;nimi i tekstit brenda nj&euml; elementi
    document.getElementById("persh").innerHTML = "P&euml;rsh&euml;ndetje Bot&euml;!";
    
    // Sh&euml;nimi i vlerave t&euml; variablave brenda nj&euml; elementi
    var x = 10;
    var y = 20;
    var shuma = x + y;
    document.getElementById("rezul").innerHTML = shuma;
&lt;/script&gt;</code></pre>
                </div>
	        </div> 
        </section>
        
        <section id="tipet-e-te-dhenave">
            <h1>Tipet e t&euml; dh&euml;nave</h1>
            <p>Tipet e t&euml; dh&euml;nave n&euml; thelb specifikojn&euml; se &ccedil;far&euml; lloj i t&euml; dh&euml;nave mund t&euml; ruhen dhe t&euml; manipulohet brenda nj&euml; programi.</p>
            <p>Ekzistojn&euml; gjasht&euml; tipe themelore t&euml; t&euml; dh&euml;nave n&euml; JavaScript, t&euml; cilat mund t&euml; ndahen n&euml; tri kategori kryesore: primitive (ose primare - <em>primary</em>), t&euml; p&euml;rb&euml;ra (ose referenc&euml; - <em>reference</em>) dhe tipe speciale t&euml; t&euml; dh&euml;nave. <strong><em>String</em></strong>, <strong><em>Number</em></strong> dhe <strong><em>Boolean</em></strong> jan&euml; lloje primitive t&euml; t&euml; dh&euml;nave. <strong><em>Object</em></strong>, <strong><em>Array</em></strong> dhe <strong><em>Function</em></strong> (t&euml; gjitha jan&euml; tipe t&euml; objekteve) jan&euml; tipe t&euml; t&euml; dh&euml;nave t&euml; p&euml;rb&euml;ra. Nd&euml;rsa <strong><em>Undefined</em></strong> dhe <strong><em>Null</em></strong> jan&euml; tipe speciale t&euml; t&euml; dh&euml;nave.</p>
            <p>Tipet primitive t&euml; t&euml; dh&euml;nave mund t&euml; p&euml;rmbajn&euml; vet&euml;m nj&euml; vler&euml; n&euml; t&euml; nj&euml;jt&euml;n koh&euml;, nd&euml;rsa tipet e t&euml; dh&euml;nave t&euml; p&euml;rb&euml;ra mund t&euml; p&euml;rmbajn&euml; koleksione vlerash dhe nj&euml;si m&euml; komplekse.</p>
            <h2>Tipi i t&euml; dh&euml;nave String</h2>
            <p>Tipi i t&euml; dh&euml;nave <em>string</em> p&euml;rdoret p&euml;r t&euml; p&euml;rfaq&euml;suar t&euml; dh&euml;nat tekstuale (d.m.th. sekuencat e karaktereve). Stringjet krijohen duke p&euml;rdorur thonj&euml;zat e vetme ose t&euml; dyfishta q&euml; rrethojn&euml; nj&euml; ose m&euml; shum&euml; karaktere, si&ccedil; tregohet m&euml; posht&euml;:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var a = 'Përshëndetje!'; // përdorimi i thonjëzave të njëfishta
var b = "Përshëndetje!"; // përdorimi i thonjëzave të dyfishta</code></pre>
                </div>
	        </div>         
            <p>Stringu mund t&euml; p&euml;rmbaj&euml; thonj&euml;za brenda vetes p&euml;r sa koh&euml; q&euml; ato nuk p&euml;rputhen me thonj&euml;zat q&euml; e krijojn&euml; at&euml; string.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var a = "Do t'i mësoj këto mësime."; // thonjëza të njëfishta brenda thonjëzave të dyfishta
var b = 'Ai tha "Tung!" dhe iku.'; // thonjëza të dyfishta brenda thonjëzave të njëfishta 
var c = 'Do t\'i mësoj këto mësime.'; // duke i ikur thonjëzave të njëfishta me vijë të pjerrtë</code></pre>
                </div>
	        </div> 
            <h2>Tipi i t&euml; dh&euml;nave <em>Number</em></h2>
            <p>Tipi i t&euml; dh&euml;nave <em>number</em> p&euml;rdoret p&euml;r t&euml; prezantuar numra pozitiv&euml; apo negativ&euml; me ose pa presje dhjetore, ose numra t&euml; sh&euml;nuar duke p&euml;rdorur sh&euml;nimin eksponencial p.sh. 1.5e-4 (ekuivalent me 1.5x10<sup>-4</sup>).</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var a = 25;         // intexher – numër i plotë
var b = 80.5;       // numër me pike të lëvizshme
var c = 4.25e+6;    // shënimi eksponencial, njëjtë 4.25e6 ose 4250000
var d = 4.25e-6;    // shënimi eksponencial, njëjtë 0.00000425</code></pre>
                </div>
	        </div> 
            <p>Tipi i t&euml; dh&euml;nave <em>Number</em> p&euml;rfshin gjithashtu disa vlera t&euml; ve&ccedil;anta t&euml; cilat jan&euml;: <code>Infinity</code>, <code>-Infinity</code> dhe <code>NaN</code>. Infinity paraqet pafund&euml;si matematikore <code>&infin;</code>, e cila &euml;sht&euml; m&euml; e madhe se &ccedil;do num&euml;r. Pafund&euml;sia &euml;sht&euml; rezultat i ndarjes s&euml; nj&euml; numri jo zero me 0, si&ccedil; demonstrohet m&euml; posht&euml;:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>alert(16 / 0);  // Dalja: Infinity
alert(-16 / 0); // Dalja: -Infinity
alert(16 / -0); // Dalja: -Infinity</code></pre>
                </div>
	        </div> 
            <p>Nd&euml;rsa <code>NaN</code> p&euml;rfaq&euml;son nj&euml; vler&euml; t&euml; ve&ccedil;ant&euml; <em>Not-a-Number</em> (jo num&euml;r). Kjo &euml;sht&euml; rezultat i nj&euml; veprimi matematikor t&euml; pavlefsh&euml;m ose t&euml; pap&euml;rcaktuar, si llogaritja e rr&euml;nj&euml;s katrore t&euml; -1 ose pjes&euml;timi i 0 me 0, etj.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>alert("Ndonjë tekst" / 2);      // Dalja: NaN
alert("Ndonjë tekst" / 2 + 10); // Dalja: NaN
alert(Math.sqrt(-1));           // Dalja: NaN</code></pre>
                </div>
	        </div> 
            <h2>Tipi i t&euml; dh&euml;nave <em>Boolean</em></h2>
            <p>Tipi i t&euml; dh&euml;nave <em>Boolean</em> p&euml;rmban vet&euml;m dy vlera: <code>true</code> ose <code>false</code> (<em>e sakt</em> ose <em>e pasakt</em>). Zakonisht p&euml;rdoret p&euml;r t&euml; ruajtur vlera si <strong>po</strong> (<code>true</code>) ose <strong>jo</strong> (<code>false</code>), e ndezur (<code>true</code>) ose e fikur (<code>false</code>), etj., si&ccedil; demonstrohet m&euml; posht&euml;:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var poLexon = true;   // po, unë po lexoj
var poFlen = false;   // jo, unë nuk po flej</code></pre>
                </div>
            </div>
            <p>Vlerat <em>Boolean</em> gjithashtu vijn&euml; si rezultat i krahasimeve n&euml; nj&euml; program. Shembulli i m&euml;posht&euml;m krahason dy variabla dhe tregon rezultatin n&euml; dialog-dritaren pop-up:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var a = 2, b = 5, c = 10;
alert(b > a) // Dalja: true
alert(b > c) // Dalja: false</code></pre>
                </div>
	        </div> 
            <h2>Tipi i t&euml; dh&euml;nave <em>Undefined</em></h2>
            <p>Tipi i t&euml; dh&euml;nave <em>undefined</em> mund t&euml; ket&euml; vet&euml;m nj&euml; vler&euml; - vler&euml;n speciale <code>undefined</code> (e padefinuar). N&euml;se nj&euml; variab&euml;l &euml;sht&euml; deklaruar, por nuk i &euml;sht&euml; caktuar nj&euml; vler&euml;, vlera e saj do t&euml; jet&euml; <code>undefined</code>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var a;
var b = "Përshëndetje Botë!"
     
alert(a) // Dalja: undefined
alert(b) // Dalja: Përshëndetje Botë!</code></pre>
                </div>
	        </div> 
            <h2>Tipi i t&euml; dh&euml;nave <em>Null</em></h2>
            <p>Ky &euml;sht&euml; nj&euml; tjet&euml;r tip i ve&ccedil;ant&euml; i t&euml; dh&euml;nave q&euml; mund t&euml; ket&euml; vet&euml;m nj&euml; vler&euml; - vler&euml;n <code>null</code>. Nj&euml; vler&euml; <em>null</em> do t&euml; thot&euml; se nuk ka vler&euml;. Nuk &euml;sht&euml; ekuivalent me nj&euml; string t&euml; zbrazt&euml; ("") ose 0, thjesht nuk &euml;sht&euml; asgj&euml;.</p>
            <p>Nj&euml; variab&euml;l mund t&euml; jet&euml; e zbraz&euml;t n&euml; m&euml;nyr&euml; t&euml; qart&euml; nga p&euml;rmbajtja e saj aktuale duke i caktuar asaj vler&euml;n <code>null</code>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var a = null;
alert(a); // Dalja: null
     
var b = "Përshëndetje Botë!"
alert(b); // Dalja: Përshëndetje Botë!
     
b = null;
alert(b) // Dalja: null</code></pre>
                </div>
            </div>
            <h2>Tipi i t&euml; dh&euml;nave <em>Object</em></h2>
            <p><code>Object</code> (objekti) &euml;sht&euml; nj&euml; tip kompleks i t&euml; dh&euml;nave q&euml; ju lejon t&euml; ruani koleksione t&euml; t&euml; dh&euml;nave.</p>
            <p>Nj&euml; objekt p&euml;rmban veti (<em>properties</em>), t&euml; definuara si nj&euml; &ccedil;ift me vler&euml; ky&ccedil;e. Nj&euml; &ccedil;el&euml;s i vetis&euml; (emri) &euml;sht&euml; gjithmon&euml; nj&euml; sring, por vlera mund t&euml; jet&euml; &ccedil;far&euml;do tip i t&euml; dh&euml;nave, si <em>string</em>, <em>number</em>, <em>boolean</em>, ose tipe komplekse t&euml; t&euml; dh&euml;nave si <em>array</em>, <em>function</em> dhe objekte t&euml; tjera.</p>
            <p>Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; m&euml;nyr&euml;n m&euml; t&euml; thjesht&euml; p&euml;r t&euml; krijuar nj&euml; objekt n&euml; JavaScript.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var objektZbrazet = {};
var personi = {"emri": "Filan", "mbiemri": "Fisteku", "mosha": "17"};
     
// Për lexim më të mirë
var vetura = {
    "model": "BMW X3",
    "ngjyra": "bardhë",
    "dyer": 5
}</code></pre>
                </div>
            </div>
            <p>Mund t&rsquo;i hiqni thonj&euml;zat te emri i vetis&euml; (<em>property name</em>) n&euml;se emri i till&euml; &euml;sht&euml; nj&euml; em&euml;r i vlefsh&euml;m JavaScript. Kjo do t&euml; thot&euml; q&euml; thonj&euml;zat nevojiten p&euml;rreth <code>"emri-babait"</code> por jan&euml; opsionale p&euml;rreth <code>emriBabait</code>. Pra, objekti vetura n&euml; shembullin e m&euml;sip&euml;rm mund t&euml; shkruhet gjithashtu si:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var vetura = {
    model: "BMW X3",
    ngjyra: "white",
    dyer: 5
}</code></pre>
                </div>
	        </div> 
            <h2>Tipi i t&euml; dh&euml;nave <em>Array</em></h2>
            <p>Nj&euml; varg (<em>array</em>) &euml;sht&euml; nj&euml; tip i objektit q&euml; p&euml;rdoret p&euml;r ruajtjen e vlerave t&euml; shumta n&euml; nj&euml; variab&euml;l t&euml; vetme. &Ccedil;do vler&euml; (e quajtur gjithashtu nj&euml; element) n&euml; nj&euml; varg ka nj&euml; pozicion numerik, i njohur si indeksi i tij, dhe mund t&euml; p&euml;rmbaj&euml; t&euml; dh&euml;na t&euml; &ccedil;do tipi &ndash; vlera numerike, stringje, vlera boolean, funksione, objekte, e gjithashtu edhe varg tjet&euml;r. Indeksi i vargut fillon nga 0, k&euml;shtu q&euml; elementi i par&euml; i vargut &euml;sht&euml; <code>arr[0]</code> e jo <code>arr[1]</code>.</p>
            <p>M&euml;nyra m&euml; e thjesht&euml; p&euml;r t&euml; krijuar nj&euml; varg &euml;sht&euml; duke specifikuar elementet e vargut si nj&euml; list&euml; e ndar&euml; me presje dhe e mbyllur nga kllapa t&euml; mesme.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var ngjyra = ["Kuqe", "Verdhë", "Kaltër", "Gjelbër"];
var qytete = ["Bujanoc", "Prishtinë", "Tiranë", "Shkup"];
     
alert(ngjyra[0]);   // Rezultati: Kuqe
alert(qytete[2]);   // Rezultati: Tiranë</code></pre>
                </div>
	        </div> 
            <h2>Tipi i t&euml; dh&euml;nave <em>Function</em></h2>
            <p>Funksioni &euml;sht&euml; nj&euml; objekt q&euml; mund t&euml; thirret e q&euml; ekzekuton nj&euml; bllok kodi. Meqen&euml;se funksionet jan&euml; objekte, k&euml;shtu q&euml; &euml;sht&euml; e mundur t'i caktoni atyre nj&euml; variab&euml;l, si&ccedil; tregohet n&euml; shembullin m&euml; posht&euml;:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var persh = function(){ 
    return "Përshëndetje Botë!"; 
}
 
// Kontrolloni tipin e variablës persh
alert(typeof persh)    // Dalja: function
alert(persh());        // Dalja: Përshëndetje Botë!</code></pre>
                </div>
            </div>
            <p>N&euml; fakt, funksionet mund t&euml; p&euml;rdoren n&euml; &ccedil;do vend, p&euml;r &ccedil;far&euml;do vlere tjet&euml;r q&euml; mund t&euml; p&euml;rdoret. Funksionet mund t&euml; ruhen n&euml; variabla, objekte dhe vargje. Funksionet mund t&euml; kalojn&euml; si argumente n&euml; funksione tjera, si dhe funksionet mund t&euml; rikthehen nga funksionet. Merrni parasysh funksionin e m&euml;posht&euml;m:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>function krijoPersh(emri){
    return "Përshëndetje, " + emri;
}
function paraqitPersh(funkPersh, emriPerdoruesit){
    return funkPersh(emriPerdoruesit);
}
 
var rezultati = paraqitPersh(krijoPersh, "Agron");
alert(rezultati); // Dalja: Përshëndetje, Agron
</code></pre>
                </div>
            </div>
            <h2>Operatori <em>typeof</em></h2>
            <p>Operatori <code>typeof</code> mund t&euml; p&euml;rdoret p&euml;r t&euml; identifikuar se &ccedil;far&euml; tipi t&euml; t&euml; dh&euml;nave p&euml;rmban nj&euml; variab&euml;l ose operand. Mund t&euml; p&euml;rdoret me ose pa kllapa (<code>typeof(x)</code> ose <code>typeof x</code>).</p>
            <p>Operatori <code>typeof</code> &euml;sht&euml; ve&ccedil;an&euml;risht i dobish&euml;m n&euml; situatat kur duhet ndryshe t&rsquo;i p&euml;rpunoni vlerat e tipeve t&euml; ndryshme, por duhet t&euml; jeni shum&euml; t&euml; kujdessh&euml;m, sepse mund t&euml; prodhoj&euml; rezultat t&euml; papritur n&euml; disa raste, si&ccedil; demonstrohet n&euml; shembullin vijues:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>// Numra
typeof 15;  // Tipi: "number"
typeof 42.7;  // Tipi: "number"
typeof 2.5e-4;  // Tipi: "number"
typeof Infinity;  // Tipi: "number"
typeof NaN;  // Tipi: "number". Pavarësisht se është "jo-numër"
     
// Stringje
typeof '';  // Tipi: "string"
typeof 'hello';  // Tipi: "string"
typeof '12';  // Tipi: "string". Numri me thonjëza është string
     
// Boolean
typeof true;  // Tipi: "boolean"
typeof false;  // Tipi: "boolean"
     
// Undefined
typeof undefined;  // Tipi: "undefined"
typeof variabelPadeklaruar; // Tipi: "undefined"
     
// Null
typeof Null;  // Tipi: "object"
     
// Objekte
typeof {emri: "Agon", mosha: 17};  // Tipi: "object"
     
// Vargje
typeof [1, 2, 4];  // Tipi: "object"
     
// Funksione
typeof function(){};  // Tipi: "function"</code></pre>
                </div>
            </div>
            <p>Si&ccedil; mund ta shihni qart&euml; n&euml; shembullin e m&euml;sip&euml;rm, kur testojm&euml; vler&euml;n <code>null</code> duke p&euml;rdorur operatorin <code>typeof</code>, ai ktheu tipin e t&euml; dh&euml;nave "objekt" n&euml; vend t&euml; "null".</p>
            <p>Ky &euml;sht&euml; nj&euml; gabim i kahersh&euml;m n&euml; JavaScript, por meqen&euml;se shum&euml; kode n&euml; internet shkruhen rreth k&euml;saj sjelljeje dhe duke e rregulluar k&euml;shtu do t&euml; krijonte shum&euml; m&euml; tep&euml;r problem, k&euml;shtu q&euml; ideja e rregullimit t&euml; k&euml;saj &ccedil;&euml;shtjeje u refuzua nga komisioni q&euml; harton dhe mir&euml;mban JavaScript.</p>

        </section>
        
        <section id="operatoret">
            <h1>Operator&euml;t n&euml; JavaScript</h1>
            <p>Operator&euml;t jan&euml; simbole ose fjal&euml; ky&ccedil;e q&euml; i thon&euml; JavaScript-it t&euml; kryej&euml; disa veprime. P&euml;r shembull, simboli i mbledhjes (+) &euml;sht&euml; nj&euml; operator q&euml; i thot&euml; JavaScript-it t&euml; shtoj&euml; dy variabla ose vlera, nd&euml;rsa simbolet e barazimeve (==), m&euml; e m&euml;dha se (&gt;) ose m&euml; vog&euml;l se (&lt;) jan&euml; operator&euml; q&euml; i thon&euml; JavaScript-it t&euml; krahasoj&euml; dy variabla ose vlera, etj.</p>
            <h2>Operator&euml;t aritmetik&euml;</h2>
            <p>Operator&euml;t aritmetik&euml; p&euml;rdoren p&euml;r t&euml; kryer veprime t&euml; zakonshme aritmetike, t&euml; tilla si mbledhja, zbritja, shum&euml;zimi etj. M&euml; posht&euml; &euml;sht&euml; paraqitur nj&euml; list&euml; e plot&euml; e operator&euml;ve aritmetik&euml; n&euml; JavaScript:</p>
            <div class="tabela">
                <table>
                    <tr>
                    <td>
                    <p><strong>Operatori</strong></p>
                    </td>
                    <td>
                    <p><strong>P&euml;rshkrimi</strong></p>
                    </td>
                    <td>
                    <p><strong>Shembull</strong></p>
                    </td>
                    <td>
                    <p><strong>Rezultati</strong></p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>+</p>
                    </td>
                    <td>
                    <p>Mbledhja</p>
                    </td>
                    <td>
                    <p>x + y</p>
                    </td>
                    <td>
                    <p>Shuma e x dhe y</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>-</p>
                    </td>
                    <td>
                    <p>Zbritja</p>
                    </td>
                    <td>
                    <p>x - y</p>
                    </td>
                    <td>
                    <p>Diferenca e x dhe y.</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>*</p>
                    </td>
                    <td>
                    <p>Shum&euml;zimi</p>
                    </td>
                    <td>
                    <p>x * y</p>
                    </td>
                    <td>
                    <p>Prodhimi i x dhe y.</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>/</p>
                    </td>
                    <td>
                    <p>Ndarja</p>
                    </td>
                    <td>
                    <p>x / y</p>
                    </td>
                    <td>
                    <p>Her&euml;si i x dhe y</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>%</p>
                    </td>
                    <td>
                    <p>Moduli</p>
                    </td>
                    <td>
                    <p>x % y</p>
                    </td>
                    <td>
                    <p>Pjesa e mbetur prej x e ndar&euml; me y</p>
                    </td>
                    </tr>
                </table>
            </div>
            
            <p>Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; k&euml;ta operator&euml; aritmetik&euml; n&euml; veprim:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var x = 10;
var y = 4;
alert(x + y); // Dalja: 14
alert(x - y); // Dalja: 6
alert(x * y); // Dalja: 40
alert(x / y); // Dalja: 2.5
alert(x % y); // Dalja: 2</code></pre>
                </div>
	        </div> 
            <h2>Operator&euml;t e caktimit</h2>
            <p>Operator&euml;t e caktimit (<em>assignment operators</em>) p&euml;rdoren p&euml;r t&rsquo;ju caktuar vlera variablave:</p>
            <div class="tabela">
                <table>
                    <tr>
                    <td>
                    <p><strong>Operatori</strong></p>
                    </td>
                    <td>
                    <p><strong>P&euml;rshkrimi</strong></p>
                    </td>
                    <td>
                    <p><strong>Shembull</strong></p>
                    </td>
                    <td>
                    <p><strong>&Euml;sht&euml; e nj&euml;jt&euml; me</strong></p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>=</p>
                    </td>
                    <td>
                    <p>Cakto</p>
                    </td>
                    <td>
                    <p>x = y</p>
                    </td>
                    <td>
                    <p>x = y</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>+=</p>
                    </td>
                    <td>
                    <p>Shto dhe cakto</p>
                    </td>
                    <td>
                    <p>x += y</p>
                    </td>
                    <td>
                    <p>x = x + y</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>-=</p>
                    </td>
                    <td>
                    <p>Zbrit dhe cakto</p>
                    </td>
                    <td>
                    <p>x -= y</p>
                    </td>
                    <td>
                    <p>x = x - y</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>*=</p>
                    </td>
                    <td>
                    <p>Shum&euml;zo dhe cakto</p>
                    </td>
                    <td>
                    <p>x *= y</p>
                    </td>
                    <td>
                    <p>x = x * y</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>/=</p>
                    </td>
                    <td>
                    <p>Ndani dhe caktoni her&euml;sin</p>
                    </td>
                    <td>
                    <p>x /= y</p>
                    </td>
                    <td>
                    <p>x = x / y</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>%=</p>
                    </td>
                    <td>
                    <p>Ndani dhe caktoni modulin</p>
                    </td>
                    <td>
                    <p>x %= y</p>
                    </td>
                    <td>
                    <p>x = x % y</p>
                    </td>
                    </tr>
                </table>
            </div>
            
            <p>&nbsp;Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; n&euml; veprim k&euml;ta operator&euml; t&euml; caktimit:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var x;    // Deklarimi i variablës
 
x = 10;
alert(x); // Dalja: 10
     
x = 20;
x += 30;
alert(x); // Dalja: 50
     
x = 50;
x -= 20;
alert(x); // Dalja: 30
     
x = 5;
x *= 25;
alert(x); // Dalja: 125
     
x = 50;
x /= 10;
alert(x); // Dalja: 5
     
x = 100;
x %= 15;
alert(x); // Dalja: 10</code></pre>
                </div>
	        </div> 
            <h2>Operator&euml;t e stringjeve</h2>
            <p>Ekzistojn&euml; dy operator&euml; t&euml; cil&euml;t mund t&euml; p&euml;rdoren gjithashtu tek stringjet.</p>
            <div class="tabela">
                <table>
                    <tr>
                    <td>
                    <p><strong>Operatori</strong></p>
                    </td>
                    <td>
                    <p><strong>P&euml;rshkrimi</strong></p>
                    </td>
                    <td>
                    <p><strong>Shembull</strong></p>
                    </td>
                    <td >
                    <p><strong>Rezultati</strong></p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>+</p>
                    </td>
                    <td>
                    <p>Bashkimi</p>
                    </td>
                    <td>
                    <p>str1 + str2</p>
                    </td>
                    <td>
                    <p>Bashkimi i str1 dhe str2</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>+=</p>
                    </td>
                    <td>
                    <p>Bashkimi i vler&euml;s s&euml; caktuar</p>
                    </td>
                    <td>
                    <p>str1 += str2</p>
                    </td>
                    <td>
                    <p>Shtimi i str2 tek str1</p>
                    </td>
                    </tr>
                </table>
            </div>
            <p>Shembulli m&euml;posht&euml;m do t'ju tregoj&euml; k&euml;ta operator&euml; t&euml; stringjeve n&euml; veprim:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var str1 = "Përshëndetje";
var str2 = " Botë!";
     
alert(str1 + str2); // Dalja: Përshëndetje Botë!
     
str1 += str2;
alert(str1); // Dalja: Përshëndetje Botë!</code></pre>
                </div>
            </div>
            <h2>Operator&euml;t p&euml;r rritje dhe zbritje</h2>
            <p>Operator&euml;t e rritjes / zbritjes p&euml;rdoren p&euml;r t&euml; rritur / zvog&euml;luar vler&euml;n e nj&euml; variable.</p>
            <div class="tabela">
                <table>
                    <tr>
                    <td>
                    <p><strong>Operatori</strong></p>
                    </td>
                    <td>
                    <p><strong>Em&euml;rtimi</strong></p>
                    </td>
                    <td>
                    <p><strong>Efekti</strong></p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>++x</p>
                    </td>
                    <td>
                    <p>Para-rritja</p>
                    </td>
                    <td>
                    <p>Rritja e x-it p&euml;r nj&euml;, pastaj kthimi i x-it</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>x++</p>
                    </td>
                    <td>
                    <p>Pas-rritja</p>
                    </td>
                    <td>
                    <p>Kthimi i x-it, pastaj rritja e x-it p&euml;r nj&euml;</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>--x</p>
                    </td>
                    <td>
                    <p>Para-zbritja</p>
                    </td>
                    <td>
                    <p>Zvog&euml;limi i x-it p&euml;r nj&euml;, pastaj kthimi i x-it</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>x--</p>
                    </td>
                    <td>
                    <p>Pas-zbritja</p>
                    </td>
                    <td>
                    <p>Kthimi i x-it, pastaj zvog&euml;limi i x-it p&euml;r nj&euml;</p>
                    </td>
                    </tr>
                </table>
            </div>
            
            <p>Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; se si funksionojn&euml; n&euml; t&euml; v&euml;rtet&euml; operator&euml;t e rritjes dhe zbritjes:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var x; // Deklarimi i variablës
 
x = 10;
alert(++x); // Dalja: 11
alert(x);   // Dalja: 11
     
x = 10;
alert(x++); // Dalja: 10
alert(x);   // Dalja: 11
     
x = 10;
alert(--x); // Dalja: 9
alert(x);   // Dalja: 9
     
x = 10;
alert(x--); // Dalja: 10
alert(x);   // Dalja: 9</code></pre>
                </div>
            </div>
            <h2>Operator&euml;t logjik</h2>
            <p>Operator&euml;t logjik&euml; zakonisht p&euml;rdoren p&euml;r t&euml; kombinuar pohimet e kusht&euml;zuara.</p>
            <div class="tabela">
                <table>
                    <tr>
                    <td>
                    <p><strong>Operatori</strong></p>
                    </td>
                    <td>
                    <p><strong>Emri</strong></p>
                    </td>
                    <td>
                    <p><strong>Shembull</strong></p>
                    </td>
                    <td>
                    <p><strong>Rezultati</strong></p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>&amp;&amp;</p>
                    </td>
                    <td>
                    <p>And</p>
                    </td>
                    <td>
                    <p>x &amp;&amp; y</p>
                    </td>
                    <td>
                    <p><code>true</code> n&euml;se edhe x edhe y jan&euml; <code>true</code></p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>||</p>
                    </td>
                    <td>
                    <p>Or</p>
                    </td>
                    <td>
                    <p>x || y</p>
                    </td>
                    <td>
                    <p><code>true</code> n&euml;se x ose y jan&euml; <code>true</code></p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>!</p>
                    </td>
                    <td>
                    <p>Not</p>
                    </td>
                    <td>
                    <p>!x</p>
                    </td>
                    <td>
                    <p><code>true</code> n&euml;se x nuk &euml;sht&euml; <code>true</code></p>
                    </td>
                    </tr>
                </table>
            </div>
            <p>Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; se si funksionojn&euml; n&euml; t&euml; v&euml;rtet&euml; k&euml;ta operator&euml; logjik&euml;:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var viti = 2020;
 
// Vitet e brishtë plotëpjestohen me 400 ose me 4 por jo me 100
if((viti % 400 == 0) || ((viti % 100 != 0) && (viti % 4 == 0))){
    alert(viti + " është vit i brishtë.");
} else {
    alert(viti + " nuk është vit i brishtë.");
}</code></pre>
                </div>
	        </div> 
            <h2>Operator&euml;t e krahasimit</h2>
            <p>Operator&euml;t e krahasimit p&euml;rdoren p&euml;r t&euml; krahasuar dy vlera Boolean.</p>
            <div class="tabela">
                <table>
                    <tr>
                    <td>
                    <p><strong>Operatori</strong></p>
                    </td>
                    <td>
                    <p><strong>Emri</strong></p>
                    </td>
                    <td>
                    <p><strong>Shembull</strong></p>
                    </td>
                    <td>
                    <p><strong>Rezultati</strong></p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>==</p>
                    </td>
                    <td>
                    <p>Barazi</p>
                    </td>
                    <td>
                    <p>x == y</p>
                    </td>
                    <td>
                    <p><code>true</code> n&euml;se x &euml;sht&euml; baras me y</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>===</p>
                    </td>
                    <td>
                    <p>Identik</p>
                    </td>
                    <td>
                    <p>x === y</p>
                    </td>
                    <td>
                    <p><code>true</code> n&euml;se x &euml;sht&euml; baras me y dhe jan&euml; tip i nj&euml;jt&euml;</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>!=</p>
                    </td>
                    <td>
                    <p>Jo barazi</p>
                    </td>
                    <td>
                    <p>x != y</p>
                    </td>
                    <td>
                    <p><code>true</code> n&euml;se x nuk &euml;sht&euml; baras me y</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>!==</p>
                    </td>
                    <td>
                    <p>Jo identik</p>
                    </td>
                    <td>
                    <p>x !== y</p>
                    </td>
                    <td>
                    <p><code>true</code> n&euml;se x nuk &euml;sht&euml; baras me y dhe nuk jan&euml; tip i nj&euml;jt&euml;</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>&lt;&nbsp;</p>
                    </td>
                    <td>
                    <p>M&euml; e vog&euml;l se</p>
                    </td>
                    <td>
                    <p>x &lt; y</p>
                    </td>
                    <td>
                    <p><code>true</code> n&euml;se x &euml;sht&euml; e vog&euml;l se y</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>&gt;&nbsp;</p>
                    </td>
                    <td>
                    <p>M&euml; e madhe se</p>
                    </td>
                    <td>
                    <p>x &gt; y</p>
                    </td>
                    <td>
                    <p><code>true</code> n&euml;se x &euml;sht&euml; e madhe se y</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>&gt;=</p>
                    </td>
                    <td>
                    <p>M&euml; e madhe ose e barabart&euml;</p>
                    </td>
                    <td>
                    <p>x &gt;= y</p>
                    </td>
                    <td>
                    <p><code>true</code> n&euml;se x &euml;sht&euml; m&euml; e madhe ose e barabart&euml; me y</p>
                    </td>
                    </tr>
                    <tr>
                    <td>
                    <p>&lt;=</p>
                    </td>
                    <td>
                    <p>M&euml; e vog&euml;l ose e barabart&euml;</p>
                    </td>
                    <td>
                    <p>x &lt;= y</p>
                    </td>
                    <td>
                    <p><code>true</code> n&euml;se x &euml;sht&euml; m&euml; e vog&euml;l ose e barabart&euml; me y</p>
                    </td>
                    </tr>
                </table>
            </div>
            <p>Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; k&euml;ta operator&euml; krahasimi n&euml; veprim:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>var x = 25;
var y = 35;
var z = "25";
     
alert(x == z);  // Rezultati: true
alert(x === z); // Rezultati: false
alert(x != y);  // Rezultati: true
alert(x !== z); // Rezultati: true
alert(x < y);   // Rezultati: true
alert(x > y);   // Rezultati: false
alert(x <= y);  // Rezultati: true
alert(x >= y);  // Rezultati: false</code></pre>
                </div>
	        </div> 

        </section>

        <section id="eventet">
            <h1>Ngjarjet (<em>Eventet</em>)</h1>
            <p>Nj&euml; event &euml;sht&euml; di&ccedil;ka q&euml; ndodh kur p&euml;rdoruesi nd&euml;rvepron me ueb faqen, t&euml; tilla si: kur ai klikon n&euml; nj&euml; link ose buton, fut tekst n&euml; nj&euml; input boks ose n&euml; tekstarea, selekton n&euml; nj&euml; boks t&euml; zgjedhur, shtyp nj&euml; tast n&euml; tastier&euml;, l&euml;viz treguesin e mausit , paraqet nj&euml; form&euml;, etj. N&euml; disa raste, vet&euml; Shfletuesi mund t&euml; shkaktoj&euml; nj&euml; event, t&euml; tilla si eventi i ngarkimit dhe shkarkimit t&euml; faqes.</p>
            <p>Kur ndodh nj&euml; event, mund t&euml; p&euml;rdorni nj&euml; mbajt&euml;s t&euml; eventeve JavaScript &ndash; <em>event handler</em> (ose nj&euml; d&euml;gjues eventesh &ndash; <em>event</em> <em>listener</em>) p&euml;r t'i zbuluar ato dhe p&euml;r t&euml; kryer detyra specifike ose grupe detyrash. Sipas konvencionit, emrat p&euml;r mbajt&euml;sit e eventeve gjithmon&euml; fillojn&euml; me fjal&euml;n "<code>on</code>", k&euml;shtu q&euml; nj&euml; mbajt&euml;s i eventeve p&euml;r klikim quhet <code>onclick</code>, n&euml; m&euml;nyr&euml; t&euml; ngjashme nj&euml; mbajt&euml;s i eventeve p&euml;r ngarkimin e ueb faqes quhet <code>onload</code>, dhe k&euml;shtu me radh&euml;.</p>
            <p>Ka disa m&euml;nyra p&euml;r t&euml; caktuar nj&euml; mbajt&euml;s t&euml; eventeve. M&euml;nyra m&euml; e thjesht&euml; &euml;sht&euml; t'i shtoni ato direkt n&euml; etiket&euml;n fillestare t&euml; elementeve HTML duke p&euml;rdorur atributet speciale t&euml; mbajt&euml;sit t&euml; eventit. P&euml;r shembull, p&euml;r t&euml; caktuar nj&euml; mbajt&euml;s klikimi p&euml;r nj&euml; buton, mund t&euml; p&euml;rdorim atributin <code>onclick</code>, k&euml;sisoj:</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;button type="button" onclick="alert('P&euml;rsh&euml;ndetje!')"&gt;Kliko&lt;/button&gt;</code></pre>
                </div>
            </div>
            <p>Sidoqoft&euml;, p&euml;r t&euml; mbajtur JavaScript-in t&euml; ndar&euml; nga HTML-ja, mund ta cil&euml;soni mbajt&euml;sin e eventit n&euml; nj&euml; fajll JavaScript t&euml; jasht&euml;m ose ta cil&euml;soni brenda etiketave <code>&lt;script&gt;</code> dhe <code>&lt;script&gt;</code>, k&euml;sisoj:</p>       
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;button type="button" id="btn"&gt;Kliko&lt;/button&gt;
&lt;script&gt;
    function persh() {
        alert('P&euml;rsh&euml;ndetje!');
    }
    document.getElementById("btn").onclick = persh;
&lt;/script&gt;</code></pre>
                </div>
            </div>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Meqen&euml;se atributet HTML nuk jan&euml; t&euml; ndjeshme n&euml; shkronja t&euml; m&euml;dha, k&euml;shtu q&euml; <code>onclick</code> mund t&euml; shkruhet edhe si <code>onClick, OnClick</code> ose <code>ONCLICK</code>. Por <strong>vlera</strong> e tij &euml;sht&euml; e ndjeshme n&euml; shkronja t&euml; m&euml;dha.</p>
            </div>
            <p>N&euml; p&euml;rgjith&euml;si, eventet mund t&euml; kategorizohen n&euml; kat&euml;r grupe kryesore &ndash; <strong>eventet e mausit</strong>, <strong>eventet e</strong> <strong>tastier&euml;s</strong>, <strong>eventet e form&euml;s</strong> dhe <strong>eventet e dokumentit / dritares</strong>. Ekzistojn&euml; shum&euml; evente tjera, p&euml;r t&euml; cil&euml;t do t&euml; shohim kapitujt e m&euml;vonsh&euml;m.</p>
            <h2>Eventet e mausit</h2>
            <p>Eventi i mausit shkaktohet kur p&euml;rdoruesi klikon n&euml; nj&euml; element, l&euml;viz treguesin e mausit mbi nj&euml; element, etj. K&euml;tu jan&euml; disa nga eventet m&euml; t&euml; r&euml;nd&euml;sishme t&euml; mausit dhe mbajt&euml;si i eventeve t&euml; tyre.</p>
            <h3>Eventi i klikimit (<em>onclick</em>)</h3>
            <p>Eventi i klikimit ndodh kur p&euml;rdoruesi klikon n&euml; nj&euml; element n&euml; ueb faqe. Shpeshher&euml;, k&euml;to jan&euml; elemente t&euml; form&euml;s dhe linqe. Mund t&euml; trajtoni nj&euml; event klikimi me nj&euml; mbajt&euml;s t&euml; eventeve <code>onclick</code>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;button type="button" onclick="alert('Klikuat n&euml; buton!');"&gt;Kliko&lt;/button&gt;
&lt;a href="#" onclick="alert('Klikuat linkun!');"&gt;Linku&lt;/a&gt;</code></pre>
                </div>
            </div>
            <h3>Eventi i menys&euml; s&euml; kontekstit (<em>oncontextmenu</em>)</h3>
            <p>Eventi i menys&euml; s&euml; kontekstit ndodh kur nj&euml; p&euml;rdorues klikon butonin e djatht&euml; t&euml; mausit mbi nj&euml; element p&euml;r t&euml; hapur nj&euml; menu konteksti. Ju mund t&euml; trajtoni nj&euml; event t&euml; menys&euml; s&euml; kontekstit me nj&euml; mbajt&euml;s t&euml; eventeve <code>oncontextmenu</code>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;button type="button" oncontextmenu="alert('Klikuat me t&euml; djatht&euml;n e mausit n&euml; buton!');"&gt;Kliko me t&euml; djatht&euml;&lt;/button&gt;
&lt;a href="#" oncontextmenu="alert('Klikuat me t&euml; djatht&euml;n e mausit n&euml; link!');"&gt;Kliko me t&euml; djatht&euml;&lt;/a&gt;</code></pre>
                </div>
            </div>
            <h3>Eventi Maus-Over (<em>onmouseover</em>)</h3>
            <p>Eventi i maus-over ndodh kur nj&euml; p&euml;rdorues l&euml;viz treguesin e mausit mbi nj&euml; element.</p>
            <p>Ju mund ta trajtoni eventin maus-over me mbajt&euml;sin e eventit <code>onmouseover</code>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;button type="button" onmouseover="alert('Kaluat me maus mbi k&euml;t&euml; buton!');"&gt;Kalo me maus&lt;/button&gt;
&lt;a href="#" onmouseover="alert('Kaluat me maus mbi k&euml;t&euml; link!');"&gt;Kalo me maus&lt;/a&gt;</code></pre>
                </div>
            </div>
            <h3>Eventi Maus-Out (<em>onmouseout</em>)</h3>
            <p>Eventi maus-out ndodh kur p&euml;rdoruesi l&euml;viz treguesin e mausit jasht&euml; nj&euml; elementi.</p>
            <p>Mund ta trajtoni k&euml;t&euml; event me mbajt&euml;sin e eventit <code>onmouseout</code>. Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; nj&euml; mesazh alarmi kur ndodh eventi i maus-out.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;button type="button" onmouseout="alert('L&euml;viz&euml;t me muas jasht&euml; k&euml;tij butoni!');"&gt;Vendosni mausin brenda meje dhe l&euml;vizni jasht&euml;&lt;/button&gt;
&lt;a href="#" onmouseout="alert(''L&euml;viz&euml;t me muas jasht&euml; k&euml;tij linku!');"&gt;Vendosni mausin brenda meje dhe l&euml;vizni jasht&euml;&lt;/a&gt;</code></pre>
                </div>
            </div>
            <h2>Eventet e tastier&euml;s</h2>
            <p>Nj&euml; event n&euml; tastier&euml; aktivizohet kur p&euml;rdoruesi shtyp ose l&euml;shon nj&euml; buton n&euml; tastier&euml;. K&euml;tu jan&euml; disa evente m&euml; t&euml; r&euml;nd&euml;sishme t&euml; tastier&euml;s si dhe mbajt&euml;sit i tyre.</p>
            <h3>Eventi Keydown (<em>onkeydown</em>)</h3>
            <p>Eventi <em>keydown</em> ndodh kur p&euml;rdoruesi shtyp nj&euml; buton n&euml; tastier&euml;.</p>
            <p>Mund ta trajtoni eventin e k&euml;till&euml; me mbajt&euml;sin e eventit <code>onkeydown</code>. Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; nj&euml; mesazh alarmi kur ndodh eventi <em>keydown</em>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;input type="text" onkeydown="alert('Shtyp&euml;t nj&euml; tast brenda tekst-inputit!')"&gt;
&lt;textarea onkeydown="alert('Shtyp&euml;t nj&euml; tast brenda fush&euml;s tekstuale!')"&gt;&lt;/textarea&gt;</code></pre>
                </div>
            </div>
            <h3>Eventi Keyup (<em>onkeyup</em>)</h3>
            <p>Eventi <em>keyup</em> ndodh kur p&euml;rdoruesi l&euml;shon nj&euml; tast nga tastiera.</p>
            <p>Mund ta trajtoni k&euml;t&euml; event me mbajt&euml;sin e eventit <code>onkeyup</code>. Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; nj&euml; mesazh alarmi kur ndodh eventi <em>keyup</em>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;input type="text" onkeyup="alert('L&euml;shuat tastin brenda tekst-inputit!')"&gt;
&lt;textarea onkeyup="alert('L&euml;shuat nj&euml; tast brenda fush&euml;s tekstuale!')"&gt;&lt;/textarea&gt;</code></pre>
                </div>
            </div>
            <h3>Eventi Keypress (<em>onkeypress</em>)</h3>
            <p>Eventi i shtypjes s&euml; tasteve - <em>keypress</em> ndodh kur nj&euml; p&euml;rdorues shtyp nj&euml; tast n&euml; tastier&euml; e q&euml; ka nj&euml; vler&euml; t&euml; karakterit q&euml; shtypet. P&euml;r shembull, tastet si Ctrl, Shift, Alt, Esc, shigjetat, etj. nuk do t&euml; gjenerojn&euml; nj&euml; event kur shtypen, por do t&euml; gjenerojn&euml; nj&euml; event <em>keydown</em> dhe <em>keyup</em>.</p>
            <p>Mund ta trajtoni eventin <em>keypress</em> me mbajt&euml;sin e eventit <code>onkeypress</code>. Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; nj&euml; mesazh alarmi kur ndodh eventi <em>keypress</em>.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;input type="text" onkeypress="alert('Shtyp&euml;t nj&euml; tast brenda tekst-inputit!')"&gt;
&lt;textarea onkeypress="alert('Shtyp&euml;t nj&euml; tast brenda fush&euml;s tekstuale!')"&gt;&lt;/textarea&gt;</code></pre>
                </div>
            </div>
            <h2>Eventet e form&euml;s</h2>
            <p>Nj&euml; event i form&euml;s aktivizohet kur nj&euml; kontroll i form&euml;s merr ose humb fokusin apo kur p&euml;rdoruesi modifikon nj&euml; vler&euml; t&euml; kontrollit t&euml; form&euml;s, t&euml; till&euml; si sh&euml;nimi i tekstit n&euml; nj&euml; input-tekstual, zgjedhja e ndonj&euml; opsioni n&euml; nj&euml; kutin&euml; selektuese, etj. K&euml;tu jan&euml; disa nga eventet m&euml; t&euml; r&euml;nd&euml;sishme t&euml; form&euml;s dhe mbajt&euml;si i eventeve t&euml; tyre.</p>
            <h3>Eventi i fokusit (<em>onfocus</em>)</h3>
            <p>Eventi i fokusit ndodh kur p&euml;rdoruesi i jep fokus nj&euml; elementi n&euml; nj&euml; ueb faqe.</p>
            <p>Mund ta trajtoni eventin e fokusit me mbajt&euml;sin e eventit <code>onfocus</code>. Shembulli i m&euml;posht&euml;m do t&euml; nxjerr&euml; n&euml; pah sfondin e futjes s&euml; tekstit me ngjyr&euml; t&euml; verdh&euml; kur fokusohet.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;script&gt;
    function theksoInputin(elm) {
        elm.style.background = "yellow";
    }
&lt;/script&gt;
&lt;input type="text" onfocus="theksoInputin(this)"&gt;
&lt;button type="button"&gt;Butoni&lt;/button&gt;</code></pre>
                </div>
            </div>
            <div class="shenim">
                <p><strong>Sh&euml;nim</strong>: Vlera e fjal&euml;s ky&ccedil;e <code>this</code> brenda nj&euml; mbajt&euml;si t&euml; eventeve i referohet elementit q&euml; ka mbajt&euml;sin n&euml; at&euml; (d.m.th. aty ku eventi po ngjan aktualisht).</p>
            </div>
            <h3>Eventi Blur (<em>onblur</em>)</h3>
            <p>Eventi <em>blur</em> ndodh kur p&euml;rdoruesi heq fokusin nga nj&euml; element i form&euml;s apo nj&euml; dritare.</p>
            <p>Mund ta trajtoni eventin e k&euml;till&euml;t me mbajt&euml;sin e eventit <code>onblur</code>. Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; nj&euml; mesazh alarmi kur elementi tekst-input humb fokusin.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;input type="text" onblur="alert('Tekst-inputi humb fokusin!')"&gt;
&lt;button type="button"&gt;Paraqit&lt;/button&gt;</code></pre>
                </div>
            </div>
            <p>P&euml;r ta larguar fokusin nga nj&euml; element i form&euml;s, s&euml; pari klikoni brenda tij, pastaj shtypni tastin tab n&euml; tastier&euml;, pra, jepni fokusin n&euml; di&ccedil;ka tjet&euml;r, ose klikoni me maus jasht&euml; atij elementi.</p>
            <h3>Eventi i ndryshimit (<em>onchange</em>)</h3>
            <p>Eventi i ndryshimit ndodh kur nj&euml; p&euml;rdorues ndryshon vler&euml;n e nj&euml; elementi t&euml; form&euml;s.</p>
            <p>Mund ta trajtoni eventin e ndryshimit me mbajt&euml;sin e eventit <code>onchange</code>. Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; nj&euml; mesazh alarmi kur ndryshoni opsionin n&euml; kutin&euml; selektuese.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;select onchange="alert('Ndryshuat zgjedhjen!');"&gt;
    &lt;option&gt;Zgjidh&lt;/option&gt;
    &lt;option&gt;Mashkull&lt;/option&gt;
    &lt;option&gt;Fem&euml;r&lt;/option&gt;
&lt;/select&gt;</code></pre>
                </div>
            </div>
            <h3>Eventi i dor&euml;zimit (<em>onsubmit</em>)</h3>
            <p>Eventi i dor&euml;zimit ndodh vet&euml;m kur p&euml;rdoruesi paraqet nj&euml; form&euml; n&euml; nj&euml; ueb faqe.</p>
            <p>Mund ta trajtoni eventin e dor&euml;zimit me mbajt&euml;sin e eventit <code>onsubmit</code>. Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; nj&euml; mesazh alarmi kur dor&euml;zoni formularin n&euml; server.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;form action="action.php" method="post" onsubmit="alert('T&euml; dh&euml;nat nga formulari do t&euml; dor&euml;zohen n&euml; server!');"&gt;
    &lt;label&gt;Emri:&lt;/label&gt;
    &lt;input type="text" name="emri" required&gt;
    &lt;input type="submit" value="Paraqit"&gt;
&lt;/form&gt;</code></pre>
                </div>
            </div>
            <h2>Eventet e Document/Windows</h2>
            <p>Eventet iniciohen gjithashtu n&euml; situata kur faqja &euml;sht&euml; ngarkuar ose kur p&euml;rdoruesi ndryshon p&euml;rmasat e dritares s&euml; shfletuesit, etj. K&euml;tu jan&euml; disa nga eventet m&euml; t&euml; r&euml;nd&euml;sishme t&euml; document/ window dhe mbajt&euml;si i eventeve t&euml; tyre.</p>
            <h3>Eventi i ngarkes&euml;s (<em>onload</em>)</h3>
            <p>Eventi i ngarkes&euml;s ndodh kur nj&euml; ueb faqe ka p&euml;rfunduar ngarkimin e p&euml;rmbajtjes n&euml; shfletues.</p>
            <p>Mund ta trajtoni eventin e ngarkes&euml;s me mbajt&euml;sin e eventit <code>onload</code>. Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; nj&euml; mesazh alarmi sapo faqja t&euml; mbaroj&euml; s&euml; ngarkuari.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;body onload="window.alert('Faqja u ngarkua me sukses!');"&gt;
    &lt;h1&gt;Ky &euml;sht&euml; nj&euml; titull&lt;/h1&gt;
    &lt;p&gt;Ky &euml;sht&euml; nj&euml; tekst n&euml; paragraf.&lt;/p&gt;
&lt;/body&gt;</code></pre>
                </div>
            </div>
            <h3>Eventi i shkarkes&euml;s (<em>onunload</em>)</h3>
            <p>Eventi i shkarkes&euml;s ndodh kur nj&euml; p&euml;rdorues largohet nga ueb faqja aktuale.</p>
            <p>Mund ta trajtoni eventin e shkarkes&euml;s me mbajt&euml;sin e eventit <code>onunload</code>. Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; nj&euml; mesazh alarmi kur tentoni t&euml; largoheni nga faqja.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;body onunload="alert('A jeni i sigurt se d&euml;shironi t&euml; dilni nga faqja?');"&gt;
    &lt;h1&gt;Ky &euml;sht&euml; nj&euml; titull &lt;/h1&gt;
    &lt;p&gt;Ky &euml;sht&euml; nj&euml; tekst n&euml; paragraf.&lt;/p&gt;
&lt;/body&gt;</code></pre>
                </div>
            </div>
            <h3>Eventi i ndryshimit t&euml; p&euml;rmasave (<em>onresize</em>)</h3>
            <p>Eventi i ndryshimit t&euml; p&euml;rmas&euml;s ndodh kur nj&euml; p&euml;rdorues ndryshon p&euml;rmasat e dritares s&euml; shfletuesit. Eventi i ndryshimit t&euml; p&euml;rmasave ndodh gjithashtu n&euml; situata kur dritarja e shfletuesit minimizohet ose maksimizohet.</p>
            <p>Mund ta trajtoni eventin e ndryshimit t&euml; p&euml;rmasave me mbajt&euml;sin e eventit <code>onresize</code>. Shembulli i m&euml;posht&euml;m do t'ju tregoj&euml; nj&euml; mesazh alarmi kur ndryshoni p&euml;rmasat e dritares s&euml; shfletuesit n&euml; gjer&euml;si dhe lart&euml;si t&euml; re.</p>
            <div class="shembull">
                <p>Shembull:</p>
                <div class="kodi">
<pre><code>&lt;p id="rezultati"&gt;&lt;/p&gt;
&lt;script&gt;
    function displayWindowSize() {
        var w = window.outerWidth;
        var h = window.outerHeight;
        var tekst = "P&euml;rmasa e dritares: gjer&euml;sia = " + w + ", lart&euml;sia = " + h;
        document.getElementById("rezultati").innerHTML = tekst;
    }
    window.onresize = displayWindowSize;
&lt;/script&gt;</code></pre>
                </div>
	        </div> 


        </section>

    </main>

</div>

<footer>
    <p>&copy; Copyright <a href="https://amemeti.netlify.app" target="_blank">Abaz Memeti</a> MMXXI</p>
</footer>

</div>

<script src="../script/script.js"></script>
</body>
</html>